In [4]:
import pandas
d={"Roll":[1,2,3,4,5],'Name':['Lalit','Pradeep','Mukesh','Manoj','Rahul'],
   'Age':[27,29,24,26,25],'Salary':[10000,15000,30000,25000,56000]}
df=pandas.DataFrame(d)
print(df)
print(type(df))
print(type(df['Roll']))
print(df['Name'])
s=pandas.Series([1,2,3,4,5])
print(s)

   Roll     Name  Age  Salary
0     1    Lalit   27   10000
1     2  Pradeep   29   15000
2     3   Mukesh   24   30000
3     4    Manoj   26   25000
4     5    Rahul   25   56000
<class 'pandas.core.frame.DataFrame'>
<class 'pandas.core.series.Series'>
0      Lalit
1    Pradeep
2     Mukesh
3      Manoj
4      Rahul
Name: Name, dtype: object
0    1
1    2
2    3
3    4
4    5
dtype: int64

In [5]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [6]:
df.columns

Index(['Roll', 'Name', 'Age', 'Salary'], dtype='object')

In [4]:
t=df.values
print(type(t))
print(t)

<class 'numpy.ndarray'>
[[1 'Lalit' 27 10000]
 [2 'Pradeep' 29 15000]
 [3 'Mukesh' 24 30000]
 [4 'Manoj' 26 25000]
 [5 'Rahul' 25 56000]]

In [7]:
i=df.index
c=df.columns
d=df.values
print(type(i),type(c),type(d))

<class 'pandas.core.indexes.range.RangeIndex'> <class 'pandas.core.indexes.base.Index'> <class 'numpy.ndarray'>

In [8]:
i.values

array([0, 1, 2, 3, 4], dtype=int64)

In [12]:
c.values

array(['Roll', 'Name', 'Age', 'Salary'], dtype=object)

In [9]:
df.dtypes

Roll       int64
Name      object
Age        int64
Salary     int64
dtype: object

In [11]:
df.dtypes.value_counts()

int64     3
object    1
dtype: int64

In [12]:
df['Salary']

0    10000
1    15000
2    30000
3    25000
4    56000
Name: Salary, dtype: int64

In [17]:
df.Salary

0    10000
1    15000
2    30000
3    25000
4    56000
Name: Salary, dtype: int64

In [24]:
sal=df['Salary']
print(type(sal))
sal=sal+5000
print(sal)
print(df)

<class 'pandas.core.series.Series'>
0    15000
1    20000
2    35000
3    30000
4    61000
Name: Salary, dtype: int64
   Roll     Name  Age  Salary
0     1    Lalit   27   10000
1     2  Pradeep   29   15000
2     3   Mukesh   24   30000
3     4    Manoj   26   25000
4     5    Rahul   25   56000

In [25]:
sal=df['Salary']
sal>=20000

0    False
1    False
2     True
3     True
4     True
Name: Salary, dtype: bool

In [26]:
sal.add(100)

0    10100
1    15100
2    30100
3    25100
4    56100
Name: Salary, dtype: int64

In [28]:
sal.value_counts()

30000    1
25000    1
15000    1
56000    1
10000    1
Name: Salary, dtype: int64

In [29]:
sal.value_counts().head(3)

30000    1
25000    1
15000    1
Name: Salary, dtype: int64

In [30]:
df['Salary'].max()

56000

In [31]:
sal.value_counts().tail(3)

15000    1
56000    1
10000    1
Name: Salary, dtype: int64

In [33]:
import pandas as pd
S = pd.Series([11, 28, 72, 3, 5, 8],index=[12,34,56,78,90,100])
print(type(S))
print(S)
print(S[12])
S=S+5
print(S)
print(S>10)

<class 'pandas.core.series.Series'>
12     11
34     28
56     72
78      3
90      5
100     8
dtype: int64
11
12     16
34     33
56     77
78      8
90     10
100    13
dtype: int64
12      True
34      True
56      True
78     False
90     False
100     True
dtype: bool

In [34]:
print(S.index)
print(S.values)

Int64Index([12, 34, 56, 78, 90, 100], dtype='int64')
[16 33 77  8 10 13]

In [3]:
import numpy as np
X = np.array([11, 28, 72, 3, 5, 8])
print(X)
print(S.values)
# both are the same type:
print(type(S.values), type(X))

[11 28 72  3  5  8]
[11 28 72  3  5  8]
<class 'numpy.ndarray'> <class 'numpy.ndarray'>

In [35]:
fruits = ['apples', 'oranges', 'cherries', 'pears']
quantities = [20, 33, 52, 10]
S = pd.Series(quantities, index=fruits)
S

apples      20
oranges     33
cherries    52
pears       10
dtype: int64

In [36]:
fruits = ['apples', 'oranges', 'cherries', 'pears']
S = pd.Series([20, 33, 52, 10], index=fruits)
S2 = pd.Series([17, 13, 31, 32], index=fruits)
print(S + S2)
print("sum of S: ", sum(S))

apples      37
oranges     46
cherries    83
pears       42
dtype: int64
sum of S:  115

In [6]:
fruits = ['peaches', 'oranges', 'cherries', 'pears']
fruits2 = ['raspberries', 'oranges', 'cherries', 'pears']
S = pd.Series([20, 33, 52, 10], index=fruits)
S2 = pd.Series([17, 13, 31, 32], index=fruits2)
print(S + S2)

cherries       83.0
oranges        46.0
peaches         NaN
pears          42.0
raspberries     NaN
dtype: float64

In [2]:
import pandas as pd
fruits = ['apples', 'oranges', 'cherries', 'pears']
fruits_ro = ["mere", "portocale", "cireșe", "pere"]
S = pd.Series([20, 33, 52, 10], index=fruits)
S2 = pd.Series([17, 13, 31, 32], index=fruits_ro)
print(S+S2)

apples      NaN
cherries    NaN
cireșe      NaN
mere        NaN
oranges     NaN
pears       NaN
pere        NaN
portocale   NaN
dtype: float64

In [38]:
print(S['apples'])

20

In [39]:
print(S[['apples', 'oranges', 'cherries']])

apples      20
oranges     33
cherries    52
dtype: int64

In [41]:
import numpy as np
print((S + 3) * 4)
print("======================")
print(np.sin(S))

apples       92
oranges     144
cherries    220
pears        52
dtype: int64
======================
apples      0.912945
oranges     0.999912
cherries    0.986628
pears      -0.544021
dtype: float64

In [42]:
'''
pandas.Series.apply
Series.apply(func, convert_dtype=True, args=(), **kwds)
The function "func" will be applied to the Series and it returns either a 
Series or a DataFrame, depending on "func".

Parameter	Meaning
func	a function, which can be a NumPy function that will be applied to the entire Series or a Python function that will be applied to every single value of the series
convert_dtype	A boolean value. If it is set to True (default), apply will try to find better dtype for elementwise function results. If False, leave as dtype=object
args	Positional arguments which will be passed to the function "func" additionally to the values from the series.
**kwds	Additional keyword arguments will be passed as keywords to the function
'''
S.apply(np.sin)

apples      0.912945
oranges     0.999912
cherries    0.986628
pears      -0.544021
dtype: float64

In [43]:
print(S)
S.apply(lambda x: x if x > 50 else x+10 )

apples      20
oranges     33
cherries    52
pears       10
dtype: int64

apples      30
oranges     43
cherries    52
pears       20
dtype: int64

In [4]:
print(S>30)
print(S[S>30])

apples      False
oranges      True
cherries     True
pears       False
dtype: bool
oranges     33
cherries    52
dtype: int64

In [5]:
"apples" in S

True

In [7]:
import pandas as pd
cities = {"London":   8615246, 
          "Berlin":   3562166, 
          "Madrid":   3165235, 
          "Rome":     2874038, 
          "Paris":    2273305, 
          "Vienna":   1805681, 
          "Bucharest":1803425, 
          "Hamburg":  1760433,
          "Budapest": 1754000,
          "Warsaw":   1740119,
          "Barcelona":1602386,
          "Munich":   1493900,
          "Milan":    1350680}
city_series = pd.Series(cities)
print(city_series)
print(city_series.index)

London       8615246
Berlin       3562166
Madrid       3165235
Rome         2874038
Paris        2273305
Vienna       1805681
Bucharest    1803425
Hamburg      1760433
Budapest     1754000
Warsaw       1740119
Barcelona    1602386
Munich       1493900
Milan        1350680
dtype: int64
Index(['London', 'Berlin', 'Madrid', 'Rome', 'Paris', 'Vienna', 'Bucharest',
       'Hamburg', 'Budapest', 'Warsaw', 'Barcelona', 'Munich', 'Milan'],
      dtype='object')

In [5]:
'''NaN - Missing Data
Playing Pandas
One problem in dealing with data analysis tasks consists in missing data. 
Pandas makes it as easy as possible to work with missing data.
If we look once more at our previous example, we can see that the index of 
our series is the same as the keys of the dictionary we used to create 
the cities_series. Now, we want to use an index which is not overlapping 
with the dictionary keys. We have already seen that we can pass a list 
or a tuple to the keyword argument 'index' to define the index. In our 
next example, the list (or tuple) passed to the keyword parameter 
'index' will not be equal to the keys. This means that some cities from 
the dictionary will be missing and two cities ("Zurich" and "Stuttgart") 
don't occur in the dictionary.'''
my_cities = ["London", "Paris", "Zurich", "Berlin", 
             "Stuttgart", "Hamburg"]
my_city_series = pd.Series(cities, 
                           index=my_cities)
my_city_series

London       8615246.0
Paris        2273305.0
Zurich             NaN
Berlin       3562166.0
Stuttgart          NaN
Hamburg      1760433.0
dtype: float64

In [6]:
my_cities = ["London", "Paris", "Berlin", "Hamburg"]
my_city_series = pd.Series(cities, 
                           index=my_cities)
my_city_series

London     8615246
Paris      2273305
Berlin     3562166
Hamburg    1760433
dtype: int64

In [8]:
'''
The Methods isnull() and notnull()
We can see, that the cities, which are not included in the dictionary, 
get the value NaN assigned. NaN stands for "not a number". It can also be 
seen as meaning "missing" in our example.
We can check for missing values with the methods isnull and notnull:
'''
my_cities = ["London", "Paris", "Zurich", "Berlin", 
             "Stuttgart", "Hamburg"]
my_city_series = pd.Series(cities, 
                           index=my_cities)
print(my_city_series)
print(my_city_series.isnull())

London       8615246.0
Paris        2273305.0
Zurich             NaN
Berlin       3562166.0
Stuttgart          NaN
Hamburg      1760433.0
dtype: float64
London       False
Paris        False
Zurich        True
Berlin       False
Stuttgart     True
Hamburg      False
dtype: bool

In [8]:
print(my_city_series.notnull())

London        True
Paris         True
Zurich       False
Berlin        True
Stuttgart    False
Hamburg       True
dtype: bool

In [10]:
'''
Connection between NaN and None
'''
d = {"a":23, "b":45, "c":None, "d":0}
S = pd.Series(d)
print(S)
print(S.index)

a    23.0
b    45.0
c     NaN
d     0.0
dtype: float64
Index(['a', 'b', 'c', 'd'], dtype='object')

In [11]:
pd.isnull(S)

a    False
b    False
c     True
d    False
dtype: bool

In [12]:
pd.notnull(S)

a     True
b     True
c    False
d     True
dtype: bool

In [14]:
'''Filtering out Missing Data'''
print(my_city_series)
print(my_city_series.dropna())
print(my_city_series)

London       8615246.0
Paris        2273305.0
Zurich             NaN
Berlin       3562166.0
Stuttgart          NaN
Hamburg      1760433.0
dtype: float64
London     8615246.0
Paris      2273305.0
Berlin     3562166.0
Hamburg    1760433.0
dtype: float64
London       8615246.0
Paris        2273305.0
Zurich             NaN
Berlin       3562166.0
Stuttgart          NaN
Hamburg      1760433.0
dtype: float64

In [18]:
'''
Filling in Missing Data
'''
print(my_city_series.fillna(0))

London       8615246.0
Paris        2273305.0
Zurich             0.0
Berlin       3562166.0
Stuttgart          0.0
Hamburg      1760433.0
dtype: float64

In [21]:
missing_cities = {"Stuttgart":597939, "Zurich":378884}
my_city_series.fillna(missing_cities)

London       8615246.0
Paris        2273305.0
Zurich        378884.0
Berlin       3562166.0
Stuttgart     597939.0
Hamburg      1760433.0
dtype: float64

In [23]:
cities = {"London":   8615246, 
          "Berlin":   3562166, 
          "Madrid":   3165235, 
          "Rome":     2874038, 
          "Paris":    2273305, 
          "Vienna":   1805681, 
          "Bucharest":1803425, 
          "Hamburg":  1760433,
          "Budapest": 1754000,
          "Warsaw":   1740119,
          "Barcelona":1602386,
          "Munich":   1493900,
          "Milan":    1350680}
my_cities = ["London", "Paris", "Zurich", "Berlin", 
             "Stuttgart", "Hamburg"]
my_city_series = pd.Series(cities, 
                           index=my_cities)
my_city_series = my_city_series.fillna(0).astype(int)
print(my_city_series)

London       8615246
Paris        2273305
Zurich             0
Berlin       3562166
Stuttgart          0
Hamburg      1760433
dtype: int32

In [24]:
import pandas as pd
years = range(2014, 2018)
shop1 = pd.Series([2409.14, 2941.01, 3496.83, 3119.55], index=years)
shop2 = pd.Series([1203.45, 3441.62, 3007.83, 3619.53], index=years)
shop3 = pd.Series([3412.12, 3491.16, 3457.19, 1963.10], index=years)
pd.concat([shop1, shop2, shop3])

2014    2409.14
2015    2941.01
2016    3496.83
2017    3119.55
2014    1203.45
2015    3441.62
2016    3007.83
2017    3619.53
2014    3412.12
2015    3491.16
2016    3457.19
2017    1963.10
dtype: float64

In [26]:
shops_df = pd.concat([shop1, shop2, shop3], axis=1)
print(shops_df)
print(type(shops_df))

            0        1        2
2014  2409.14  1203.45  3412.12
2015  2941.01  3441.62  3491.16
2016  3496.83  3007.83  3457.19
2017  3119.55  3619.53  1963.10
<class 'pandas.core.frame.DataFrame'>

In [27]:
cities = ["Zürich", "Winterthur", "Freiburg"]
shops_df.columns = cities 
print(shops_df)
# alternative way: give names to series:
shop1.name = "Zürich"
shop2.name = "Winterthur"
shop3.name = "Freiburg"
print("------")
shops_df2 = pd.concat([shop1, shop2, shop3], axis=1)
print(shops_df2)

       Zürich  Winterthur  Freiburg
2014  2409.14     1203.45   3412.12
2015  2941.01     3441.62   3491.16
2016  3496.83     3007.83   3457.19
2017  3119.55     3619.53   1963.10
------
       Zürich  Winterthur  Freiburg
2014  2409.14     1203.45   3412.12
2015  2941.01     3441.62   3491.16
2016  3496.83     3007.83   3457.19
2017  3119.55     3619.53   1963.10

In [28]:
'''
DataFrames from Dictionaries
A DataFrame has a row and column index; it's like a dict of Series 
with a common index.
'''
import pandas as pd
cities = {"name": ["London", "Berlin", "Madrid", "Rome", 
                   "Paris", "Vienna", "Bucharest", "Hamburg", 
                   "Budapest", "Warsaw", "Barcelona", 
                   "Munich", "Milan"],
          "population": [8615246, 3562166, 3165235, 2874038,
                         2273305, 1805681, 1803425, 1760433,
                         1754000, 1740119, 1602386, 1493900,
                         1350680],
          "country": ["England", "Germany", "Spain", "Italy",
                      "France", "Austria", "Romania", 
                      "Germany", "Hungary", "Poland", "Spain",
                      "Germany", "Italy"]}
city_frame = pd.DataFrame(cities)
print(city_frame)

         name  population  country
0      London     8615246  England
1      Berlin     3562166  Germany
2      Madrid     3165235    Spain
3        Rome     2874038    Italy
4       Paris     2273305   France
5      Vienna     1805681  Austria
6   Bucharest     1803425  Romania
7     Hamburg     1760433  Germany
8    Budapest     1754000  Hungary
9      Warsaw     1740119   Poland
10  Barcelona     1602386    Spain
11     Munich     1493900  Germany
12      Milan     1350680    Italy

In [30]:
'''Retrieving the Column Names'''
city_frame.columns.values

array(['name', 'population', 'country'], dtype=object)

In [31]:
ordinals = ["first", "second", "third", "fourth",
            "fifth", "sixth", "seventh", "eigth",
            "ninth", "tenth", "eleventh", "twelvth",
            "thirteenth"]
city_frame = pd.DataFrame(cities, index=ordinals)
print(city_frame)

                 name  population  country
first          London     8615246  England
second         Berlin     3562166  Germany
third          Madrid     3165235    Spain
fourth           Rome     2874038    Italy
fifth           Paris     2273305   France
sixth          Vienna     1805681  Austria
seventh     Bucharest     1803425  Romania
eigth         Hamburg     1760433  Germany
ninth        Budapest     1754000  Hungary
tenth          Warsaw     1740119   Poland
eleventh    Barcelona     1602386    Spain
twelvth        Munich     1493900  Germany
thirteenth      Milan     1350680    Italy

In [32]:
'''Rearranging the Order of Columns
We can also define and rearrange the order of the columns at the time of 
creation of the DataFrame. This makes also sure that we will have a defined 
ordering of our columns, if we create the DataFrame from a dictionary. 
Dictionaries are not ordered, so we cannot know in advance what the ordering
of our columns will be:
'''
city_frame = pd.DataFrame(cities,
                          columns=["name", 
                                   "country", 
                                   "population"])
city_frame

         name  country  population
0      London  England     8615246
1      Berlin  Germany     3562166
2      Madrid    Spain     3165235
3        Rome    Italy     2874038
4       Paris   France     2273305
5      Vienna  Austria     1805681
6   Bucharest  Romania     1803425
7     Hamburg  Germany     1760433
8    Budapest  Hungary     1754000
9      Warsaw   Poland     1740119
10  Barcelona    Spain     1602386
11     Munich  Germany     1493900
12      Milan    Italy     1350680

In [34]:
city_frame.reindex(index=[0, 2, 4, 6,  8, 10, 12, 1, 3, 5, 7, 9, 11])

         name  country  population
0      London  England     8615246
2      Madrid    Spain     3165235
4       Paris   France     2273305
6   Bucharest  Romania     1803425
8    Budapest  Hungary     1754000
10  Barcelona    Spain     1602386
12      Milan    Italy     1350680
1      Berlin  Germany     3562166
3        Rome    Italy     2874038
5      Vienna  Austria     1805681
7     Hamburg  Germany     1760433
9      Warsaw   Poland     1740119
11     Munich  Germany     1493900

In [35]:
'''Now, we want to rename our columns. For this purpose, we will use the 
DataFrame method 'rename'. This method supports two calling conventions
(index=index_mapper, columns=columns_mapper, ...)
(mapper, axis={'index', 'columns'}, ...)
We will rename the columns of our DataFrame into Romanian names in the 
following example. We set the parameter inplace to True so that our 
DataFrame will be changed instead of returning a new DataFrame, if 
inplace is set to False, which is the default!
'''
city_frame.rename(columns={"name":"N", 
                           "country":"C", 
                           "population":"P"},
                 inplace=True)
city_frame

            N        C        P
0      London  England  8615246
1      Berlin  Germany  3562166
2      Madrid    Spain  3165235
3        Rome    Italy  2874038
4       Paris   France  2273305
5      Vienna  Austria  1805681
6   Bucharest  Romania  1803425
7     Hamburg  Germany  1760433
8    Budapest  Hungary  1754000
9      Warsaw   Poland  1740119
10  Barcelona    Spain  1602386
11     Munich  Germany  1493900
12      Milan    Italy  1350680

In [8]:
'''Existing Column as the Index of a DataFrame
 We will use the country name as the index, i.e. the list value associated 
 to the key "country" of our cities dictionary:
'''
city_frame = pd.DataFrame(cities,
                          columns=["name", "population"],
                          index=cities["country"])
city_frame

              name  population
England     London     8615246
Germany     Berlin     3562166
Spain       Madrid     3165235
Italy         Rome     2874038
France       Paris     2273305
Austria     Vienna     1805681
Romania  Bucharest     1803425
Germany    Hamburg     1760433
Hungary   Budapest     1754000
Poland      Warsaw     1740119
Spain    Barcelona     1602386
Germany     Munich     1493900
Italy        Milan     1350680

In [38]:
city_frame = pd.DataFrame(cities)
#print(city_frame)
city_frame2 = city_frame.set_index("country")
print(city_frame2)

              name  population
country
England     London     8615246
Germany     Berlin     3562166
Spain       Madrid     3165235
Italy         Rome     2874038
France       Paris     2273305
Austria     Vienna     1805681
Romania  Bucharest     1803425
Germany    Hamburg     1760433
Hungary   Budapest     1754000
Poland      Warsaw     1740119
Spain    Barcelona     1602386
Germany     Munich     1493900
Italy        Milan     1350680

In [41]:
city_frame = pd.DataFrame(cities)
city_frame.set_index("country", inplace=True)
print(city_frame)

              name  population
country
England     London     8615246
Germany     Berlin     3562166
Spain       Madrid     3165235
Italy         Rome     2874038
France       Paris     2273305
Austria     Vienna     1805681
Romania  Bucharest     1803425
Germany    Hamburg     1760433
Hungary   Budapest     1754000
Poland      Warsaw     1740119
Spain    Barcelona     1602386
Germany     Munich     1493900
Italy        Milan     1350680

In [66]:
'''
Label-Indexing on the Rows
So far we have indexed DataFrames via the columns. We will demonstrate now, 
how we can access rows from DataFrames via the locators 'loc' and 'iloc'. 
('ix' is deprecated and will be removed in the future)
'''
city_frame = pd.DataFrame(cities, 
                          columns=("name", "population"), 
                          index=cities["country"])
print(city_frame.loc['Germany'])

            name  population
Germany   Berlin     3562166
Germany  Hamburg     1760433
Germany   Munich     1493900

In [12]:
print(city_frame.loc[["Germany", "France"]])

            name  population
Germany   Berlin     3562166
Germany  Hamburg     1760433
Germany   Munich     1493900
France     Paris     2273305

In [50]:
print(city_frame.loc[city_frame.population>2000000])
print(city_frame.population>2000000)

           name  population
England  London     8615246
Germany  Berlin     3562166
Spain    Madrid     3165235
Italy      Rome     2874038
France    Paris     2273305
England     True
Germany     True
Spain       True
Italy       True
France      True
Austria    False
Romania    False
Germany    False
Hungary    False
Poland     False
Spain      False
Germany    False
Italy      False
Name: population, dtype: bool

In [51]:
'''
Sum and Cumulative Sum
We can calculate the sum of all the columns of a DataFrame or the sum of 
certain  columns:
'''
print(city_frame.sum())

name          LondonBerlinMadridRomeParisViennaBucharestHamb...
population                                             33800614
dtype: object

In [62]:
print(city_frame["population"].max() )
#city_frame.groupby(['country'])["population"].max()

8615246

KeyError: 'country'

In [67]:
x = city_frame["population"].cumsum()
print(x)

England     8615246
Germany    12177412
Spain      15342647
Italy      18216685
France     20489990
Austria    22295671
Romania    24099096
Germany    25859529
Hungary    27613529
Poland     29353648
Spain      30956034
Germany    32449934
Italy      33800614
Name: population, dtype: int64

In [68]:
'''Assigning New Values to Columns
x is a Pandas Series. We can reassign the previously calculated cumulative 
sums to the population column:
'''
city_frame["population"] = x
print(city_frame)

              name  population
England     London     8615246
Germany     Berlin    12177412
Spain       Madrid    15342647
Italy         Rome    18216685
France       Paris    20489990
Austria     Vienna    22295671
Romania  Bucharest    24099096
Germany    Hamburg    25859529
Hungary   Budapest    27613529
Poland      Warsaw    29353648
Spain    Barcelona    30956034
Germany     Munich    32449934
Italy        Milan    33800614

In [69]:
city_frame = pd.DataFrame(cities,
                          columns=["country", 
                                   "population",
                                   "cum_population"],
                          index=cities["name"])
city_frame

           country  population cum_population
London     England     8615246            NaN
Berlin     Germany     3562166            NaN
Madrid       Spain     3165235            NaN
Rome         Italy     2874038            NaN
Paris       France     2273305            NaN
Vienna     Austria     1805681            NaN
Bucharest  Romania     1803425            NaN
Hamburg    Germany     1760433            NaN
Budapest   Hungary     1754000            NaN
Warsaw      Poland     1740119            NaN
Barcelona    Spain     1602386            NaN
Munich     Germany     1493900            NaN
Milan        Italy     1350680            NaN

In [70]:
city_frame["cum_population"] = city_frame["population"].cumsum()
city_frame

           country  population  cum_population
London     England     8615246         8615246
Berlin     Germany     3562166        12177412
Madrid       Spain     3165235        15342647
Rome         Italy     2874038        18216685
Paris       France     2273305        20489990
Vienna     Austria     1805681        22295671
Bucharest  Romania     1803425        24099096
Hamburg    Germany     1760433        25859529
Budapest   Hungary     1754000        27613529
Warsaw      Poland     1740119        29353648
Barcelona    Spain     1602386        30956034
Munich     Germany     1493900        32449934
Milan        Italy     1350680        33800614

In [71]:
city_frame = pd.DataFrame(cities,
                          columns=["country", 
                                   "area",
                                   "population"],
                          index=cities["name"])
print(city_frame)

           country area  population
London     England  NaN     8615246
Berlin     Germany  NaN     3562166
Madrid       Spain  NaN     3165235
Rome         Italy  NaN     2874038
Paris       France  NaN     2273305
Vienna     Austria  NaN     1805681
Bucharest  Romania  NaN     1803425
Hamburg    Germany  NaN     1760433
Budapest   Hungary  NaN     1754000
Warsaw      Poland  NaN     1740119
Barcelona    Spain  NaN     1602386
Munich     Germany  NaN     1493900
Milan        Italy  NaN     1350680

In [72]:
'''Accessing the Columns of a DataFrame'''
print(city_frame["population"])

London       8615246
Berlin       3562166
Madrid       3165235
Rome         2874038
Paris        2273305
Vienna       1805681
Bucharest    1803425
Hamburg      1760433
Budapest     1754000
Warsaw       1740119
Barcelona    1602386
Munich       1493900
Milan        1350680
Name: population, dtype: int64

In [73]:
print(city_frame.population)

London       8615246
Berlin       3562166
Madrid       3165235
Rome         2874038
Paris        2273305
Vienna       1805681
Bucharest    1803425
Hamburg      1760433
Budapest     1754000
Warsaw       1740119
Barcelona    1602386
Munich       1493900
Milan        1350680
Name: population, dtype: int64

In [23]:
print(type(city_frame.population))

<class 'pandas.core.series.Series'>

In [74]:
city_frame.population

London       8615246
Berlin       3562166
Madrid       3165235
Rome         2874038
Paris        2273305
Vienna       1805681
Bucharest    1803425
Hamburg      1760433
Budapest     1754000
Warsaw       1740119
Barcelona    1602386
Munich       1493900
Milan        1350680
Name: population, dtype: int64

In [75]:
city_frame["area"] = 1572
print(city_frame)

           country  area  population
London     England  1572     8615246
Berlin     Germany  1572     3562166
Madrid       Spain  1572     3165235
Rome         Italy  1572     2874038
Paris       France  1572     2273305
Vienna     Austria  1572     1805681
Bucharest  Romania  1572     1803425
Hamburg    Germany  1572     1760433
Budapest   Hungary  1572     1754000
Warsaw      Poland  1572     1740119
Barcelona    Spain  1572     1602386
Munich     Germany  1572     1493900
Milan        Italy  1572     1350680

In [76]:
area = [1572, 891.85, 605.77, 1285, 
        105.4, 414.6, 228, 755, 
        525.2, 517, 101.9, 310.4, 
        181.8]
# area could have been designed as a list, a Series, an array or a scalar   
city_frame["area"] = area
print(city_frame)

           country     area  population
London     England  1572.00     8615246
Berlin     Germany   891.85     3562166
Madrid       Spain   605.77     3165235
Rome         Italy  1285.00     2874038
Paris       France   105.40     2273305
Vienna     Austria   414.60     1805681
Bucharest  Romania   228.00     1803425
Hamburg    Germany   755.00     1760433
Budapest   Hungary   525.20     1754000
Warsaw      Poland   517.00     1740119
Barcelona    Spain   101.90     1602386
Munich     Germany   310.40     1493900
Milan        Italy   181.80     1350680

In [77]:
'''Sorting DataFrames'''
city_frame = city_frame.sort_values(by="area", ascending=False)
print(city_frame)

           country     area  population
London     England  1572.00     8615246
Rome         Italy  1285.00     2874038
Berlin     Germany   891.85     3562166
Hamburg    Germany   755.00     1760433
Madrid       Spain   605.77     3165235
Budapest   Hungary   525.20     1754000
Warsaw      Poland   517.00     1740119
Vienna     Austria   414.60     1805681
Munich     Germany   310.40     1493900
Bucharest  Romania   228.00     1803425
Milan        Italy   181.80     1350680
Paris       France   105.40     2273305
Barcelona    Spain   101.90     1602386

In [78]:
city_frame = pd.DataFrame(cities,
                          columns=["country", 
                                   "area",
                                   "population"],
                          index=cities["name"])
some_areas = pd.Series([1572, 755, 181.8], 
                    index=['London', 'Hamburg', 'Milan'])
city_frame['area'] = some_areas
print(city_frame)

           country    area  population
London     England  1572.0     8615246
Berlin     Germany     NaN     3562166
Madrid       Spain     NaN     3165235
Rome         Italy     NaN     2874038
Paris       France     NaN     2273305
Vienna     Austria     NaN     1805681
Bucharest  Romania     NaN     1803425
Hamburg    Germany   755.0     1760433
Budapest   Hungary     NaN     1754000
Warsaw      Poland     NaN     1740119
Barcelona    Spain     NaN     1602386
Munich     Germany     NaN     1493900
Milan        Italy   181.8     1350680

In [80]:
'''
Inserting new columns into existing DataFrames.
Quite often it will be necessary to add or insert columns into existing 
DataFrames. For this purpose the DataFrame class provides a method "insert", 
which allows us to insert a column into a DataFrame at a specified location:

insert(self, loc, column, value, allow_duplicates=False)`
The parameters are specified as:

Parameter	Meaning
loc	int
This value should be within
the range 0 <= loc <= len(columns)
column	the column name
value	can be a list, a Series an array or a scalar
allow_duplicates	If allow_duplicates is False,
an Exception will be raised,
if column is already contained
in the DataFrame.
'''
city_frame = pd.DataFrame(cities,
                          columns=["country", 
                                   "population"],
                          index=cities["name"])
idx = 1
city_frame.insert(loc=idx, column='area', value=area)
city_frame

           country     area  population
London     England  1572.00     8615246
Berlin     Germany   891.85     3562166
Madrid       Spain   605.77     3165235
Rome         Italy  1285.00     2874038
Paris       France   105.40     2273305
Vienna     Austria   414.60     1805681
Bucharest  Romania   228.00     1803425
Hamburg    Germany   755.00     1760433
Budapest   Hungary   525.20     1754000
Warsaw      Poland   517.00     1740119
Barcelona    Spain   101.90     1602386
Munich     Germany   310.40     1493900
Milan        Italy   181.80     1350680

In [82]:
'''DataFrame from Nested Dictionaries'''
growth = {"Switzerland": {"2010": 3.0, "2011": 1.8, "2012": 1.1, "2013": 1.9},
          "Germany": {"2010": 4.1, "2011": 3.6, "2012":	0.4, "2013": 0.1},
          "France": {"2010":2.0,  "2011":2.1, "2012": 0.3, "2013": 0.3},
          "Greece": {"2010":-5.4, "2011":-8.9, "2012":-6.6, "2013":	-3.3},
          "Italy": {"2010":1.7, "2011":	0.6, "2012":-2.3, "2013":-1.9}
          } 
growth_frame = pd.DataFrame(growth)
growth_frame

      Switzerland  Germany  France  Greece  Italy
2010          3.0      4.1     2.0    -5.4    1.7
2011          1.8      3.6     2.1    -8.9    0.6
2012          1.1      0.4     0.3    -6.6   -2.3
2013          1.9      0.1     0.3    -3.3   -1.9

In [9]:
growth_frame.T

             2010  2011  2012  2013
Switzerland   3.0   1.8   1.1   1.9
Germany       4.1   3.6   0.4   0.1
France        2.0   2.1   0.3   0.3
Greece       -5.4  -8.9  -6.6  -3.3
Italy         1.7   0.6  -2.3  -1.9

In [8]:
growth_frame = growth_frame.T
growth_frame2 = growth_frame.reindex(["Switzerland", 
                                      "Italy", 
                                      "Germany", 
                                      "Greece"])
print(growth_frame2)

             2010  2011  2012  2013
Switzerland   3.0   1.8   1.1   1.9
Italy         1.7   0.6  -2.3  -1.9
Germany       4.1   3.6   0.4   0.1
Greece       -5.4  -8.9  -6.6  -3.3

In [11]:
'''Filling a DataFrame with random values:'''
import numpy as np
names = ['Frank', 'Eve', 'Stella', 'Guido', 'Lara']
index = ["January", "February", "March",
         "April", "May", "June",
         "July", "August", "September",
         "October", "November", "December"]
df = pd.DataFrame((np.random.randn(12, 5)*1000).round(2),
                  columns=names,
                  index=index)
df

             Frank      Eve   Stella    Guido     Lara
January    -976.00   998.50    49.19  -265.50   372.13
February   1441.16   509.29  1109.11   468.88  1650.29
March       963.99  -184.66 -1854.73   565.26  -666.23
April      -566.77   163.90  -374.63  -336.26  1463.42
May          75.49   767.54  -129.41   -79.63   892.25
June        292.49 -1160.49   538.61  1690.07   -65.60
July       -752.97   226.10   251.76   -94.61  -839.48
August    -1070.44  -297.18    55.48  1780.54 -1320.95
September -2161.27  -318.47   557.81  -886.42   849.96
October   -1838.13  -108.77   609.81 -2079.58  -953.30
November  -1154.89  -593.35  -830.48  -175.89   971.22
December    310.68  -397.13 -1387.52   403.64   173.85

In [14]:
'''Reading and Writing Data
Digits as File Input and Output:
All the powerful data structures like the Series and the DataFrames would 
avail to nothing, if the Pandas module wouldn't provide powerful 
functionalities for reading in and writing out data. It is not only a 
matter of having a functions for interacting with files. To be useful 
to data scientists it also needs functions which support the most 
important data formats like
a. Delimiter-separated files, like e.g. csv
b. Microsoft Excel files
c. HTML
d. XML
e. JSON

Most people take csv files as a synonym for delimter-separated values 
files. They leave the fact out of account that csv is an acronym for 
"comma separated values", which is not the case in many situations. 
Pandas also uses "csv" and contexts, in which "dsv" would be more 
appropriate.
Delimiter-separated values (DSV) are defined and stored two-dimensional 
arrays (for example strings) of data by separating the values in each 
row with delimiter characters defined for this purpose. This way of 
implementing data is often used in combination of spreadsheet 
programs, which can read in and write out data as DSV. They are 
also used as a general data exchange format.
We call a text file a "delimited text file" if it contains text in 
DSV format.
'''
'''Reading CSV and DSV Files
Pandas offers two ways to read in CSV or DSV files to be precise:
DataFrame.from_csv
read_csv
There is no big difference between those two functions, e.g. they have 
different default values in some cases and read_csv has more paramters. 
We will focus on read_csv, because DataFrame.from_csv is kept inside 
Pandas for reasons of backwards compatibility.'''

import pandas as pd
exchange_rates = pd.read_csv("dollar_euro.txt",
                             sep="\t")
print(type(exchange_rates))
print(exchange_rates)

<class 'pandas.core.frame.DataFrame'>
    Year   Average  Min USD/EUR  Max USD/EUR  Working days
0   2016  0.901696     0.864379     0.959785           247
1   2015  0.901896     0.830358     0.947688           256
2   2014  0.753941     0.716692     0.823655           255
3   2013  0.753234     0.723903     0.783208           255
4   2012  0.778848     0.743273     0.827198           256
5   2011  0.719219     0.671953     0.775855           257
6   2010  0.755883     0.686672     0.837381           258
7   2009  0.718968     0.661376     0.796495           256
8   2008  0.683499     0.625391     0.802568           256
9   2007  0.730754     0.672314     0.775615           255
10  2006  0.797153     0.750131     0.845594           255
11  2005  0.805097     0.740357     0.857118           257
12  2004  0.804828     0.733514     0.847314           259
13  2003  0.885766     0.791766     0.963670           255
14  2002  1.060945     0.953562     1.165773           255
15  2001  1.117587     1.047669     1.192748           255
16  2000  1.085899     0.962649     1.211827           255
17  1999  0.939475     0.848176     0.998502           261

In [2]:
'''
As we can see, read_csv used automatically the first line as the names 
for the columns. It is possible to give other names to the columns. 
For this purpose, we have to skip the first line by setting the parameter 
"header" to 0 and we have to assign a list with the column names to the 
parameter "names":'''
import pandas as pd
exchange_rates = pd.read_csv("dollar_euro.txt",
                             sep="\t",
                             header=0,
                             names=["year", "min", "max", "days"])
print(exchange_rates)

          year       min       max  days
2016  0.901696  0.864379  0.959785   247
2015  0.901896  0.830358  0.947688   256
2014  0.753941  0.716692  0.823655   255
2013  0.753234  0.723903  0.783208   255
2012  0.778848  0.743273  0.827198   256
2011  0.719219  0.671953  0.775855   257
2010  0.755883  0.686672  0.837381   258
2009  0.718968  0.661376  0.796495   256
2008  0.683499  0.625391  0.802568   256
2007  0.730754  0.672314  0.775615   255
2006  0.797153  0.750131  0.845594   255
2005  0.805097  0.740357  0.857118   257
2004  0.804828  0.733514  0.847314   259
2003  0.885766  0.791766  0.963670   255
2002  1.060945  0.953562  1.165773   255
2001  1.117587  1.047669  1.192748   255
2000  1.085899  0.962649  1.211827   255
1999  0.939475  0.848176  0.998502   261

In [8]:
'''
Dealing with NaN
Introduction
     NaN was introduced, at least officially, by the IEEE Standard for 
     Floating-Point Arithmetic (IEEE 754). It is a technical standard 
     for floating-point computation established in 1985 - many years 
     before Python was invented, and even a longer time befor Pandas 
     was created - by the Institute of Electrical and Electronics 
     Engineers (IEEE). It was introduced to solve problems found in 
     many floating point implementations that made them difficult to 
     use reliably and portably.
     This standard added NaN to the arithmetic formats: "arithmetic 
     formats: sets of binary and decimal floating-point data, which 
     consist of finite numbers (including signed zeros and subnormal 
     numbers), infinities, and special 'not a number' values (NaNs)
     
     'nan' in Python:
     Python knows NaN values as well. We can create it with "float":'''

n1 = float("nan")
n2 = float("Nan")
n3 = float("NaN")
n4 = float("NAN")
print(n1, n2, n3, n4)

nan nan nan nan

In [9]:
import math
n1 = math.nan
print(n1)
print(math.isnan(n1))

nan
True

In [10]:
'''
Warning: Do not perform comparison between "NaN" values or "Nan" values 
and regular numbers. A simple or simplified reasoning is this: Two things 
are "not a number", so they can be anything but most probably not the same. 
Above all there is no way of ordering NaNs:
'''
print(n1 == n2)
print(n1 == 0)
print(n1 == 100)
print(n2 < 0)

False
False
False
False

In [17]:
'''
NaN in Pandas
Example without NaNs
Before we will work with NaN data, we will process a file without any 
NaN values. The data file temperatures.csv contains the temperature data 
of six sensors taken every 15 minuts between 6:00 to 19.15 o'clock.
Reading in the data file can be done with the read_csv function:
'''
import pandas as pd
df = pd.read_csv("temperatures.csv",
                 sep=";",
                decimal=',')
print(df)
print(df.loc[:3])

        time  sensor1  sensor2  sensor3  sensor4  sensor5  sensor6
0   06:00:00     14.3     13.7     14.2     14.3     13.5     13.6
1   06:15:00     14.5     14.5     14.0     15.0     14.5     14.7
2   06:30:00     14.6     15.1     14.8     15.3     14.0     14.2
3   06:45:00     14.8     14.5     15.6     15.2     14.7     14.6
4   07:00:00     15.0     14.9     15.7     15.6     14.0     15.3
5   07:15:00     15.2     15.2     14.6     15.3     15.5     14.9
6   07:30:00     15.4     15.3     15.6     15.6     14.7     15.1
7   07:45:00     15.5     14.8     15.4     15.5     14.6     14.9
8   08:00:00     15.7     15.6     15.9     16.2     15.4     15.4
9   08:15:00     15.9     15.8     15.9     16.9     16.0     16.2
10  08:30:00     16.1     15.7     16.1     15.9     14.9     15.2
11  08:45:00     16.5     16.6     17.3     16.2     16.4     16.0
12  09:00:00     16.8     17.3     17.7     17.8     15.9     16.1
13  09:15:00     17.1     17.5     17.5     17.3     16.6     16.8
14  09:30:00     17.7     18.2     18.2     18.6     16.9     17.4
15  09:45:00     18.4     19.0     19.0     19.4     18.4     18.3
16  10:00:00     19.0     19.7     18.8     18.9     17.5     18.9
17  10:15:00     19.7     19.4     19.2     19.2     19.7     19.6
18  10:30:00     20.4     19.4     20.0     21.0     20.2     19.8
19  10:45:00     21.1     20.9     22.2     21.9     19.7     20.5
20  11:00:00     21.8     21.3     20.9     23.2     21.1     20.5
21  11:15:00     22.6     22.7     23.7     22.8     22.9     22.1
22  11:30:00     23.4     22.7     23.0     24.5     22.3     22.9
23  11:45:00     24.2     23.1     25.3     23.7     24.5     24.8
24  12:00:00     24.0     23.1     23.1     24.8     22.5     22.7
25  12:15:00     23.8     23.7     24.8     25.1     22.2     22.4
26  12:30:00     23.6     24.2     23.6     24.1     22.1     22.5
27  12:45:00     23.4     22.6     23.7     24.4     21.8     23.8
28  13:00:00     23.2     24.1     24.0     23.3     23.5     23.1
29  13:15:00     23.1     22.8     23.2     22.5     23.2     22.2
30  13:30:00     22.9     21.9     22.9     24.3     22.9     23.0
31  13:45:00     22.7     23.3     22.2     22.2     21.0     23.0
32  14:00:00     22.5     23.0     22.1     24.1     22.5     22.7
33  14:15:00     22.3     22.9     21.9     22.3     22.5     21.1
34  14:30:00     22.1     21.9     22.3     22.2     21.2     22.1
35  14:45:00     22.0     21.9     21.5     22.3     20.2     21.3
36  15:00:00     21.8     22.9     22.2     22.8     21.0     21.9
37  15:15:00     21.6     21.3     21.7     21.7     21.9     21.1
38  15:30:00     21.4     21.3     21.7     21.9     21.0     21.7
39  15:45:00     21.3     21.6     21.6     22.6     20.5     21.0
40  16:00:00     21.1     21.6     20.7     20.6     19.9     21.4
41  16:15:00     20.9     20.6     20.8     20.5     20.3     21.6
42  16:30:00     20.8     20.7     20.7     20.4     20.2     19.6
43  16:45:00     20.6     21.4     20.3     21.4     19.1     21.2
44  17:00:00     20.4     19.5     20.3     21.8     19.9     19.2
45  17:15:00     20.3     20.7     19.6     21.3     19.8     19.0
46  17:30:00     20.1     20.5     19.7     19.7     18.7     19.7
47  17:45:00     19.9     20.4     19.4     21.1     20.0     20.5
48  18:00:00     19.8     20.0     19.1     19.7     20.1     20.2
49  18:15:00     19.6     19.9     19.2     19.9     20.0     18.6
50  18:30:00     19.5     19.1     19.2     19.7     18.3     18.3
51  18:45:00     19.3     18.7     20.3     19.0     18.8     18.2
52  19:00:00     19.2     18.7     20.1     19.9     18.3     19.3
53  19:15:00     19.0     19.7     18.9     19.2     18.5     19.4
       time  sensor1  sensor2  sensor3  sensor4  sensor5  sensor6
0  06:00:00     14.3     13.7     14.2     14.3     13.5     13.6
1  06:15:00     14.5     14.5     14.0     15.0     14.5     14.7
2  06:30:00     14.6     15.1     14.8     15.3     14.0     14.2
3  06:45:00     14.8     14.5     15.6     15.2     14.7     14.6

In [13]:
'''
We want to calculate the avarage temperatures per measuring point over 
all the sensors. We can use the DataFrame method 'mean'. If we use 'mean' 
without parameters it will sum up the sensor columns, which isn't what we 
want, but it may be interesting as well:
'''
df.mean()

sensor1    19.775926
sensor2    19.757407
sensor3    19.840741
sensor4    20.187037
sensor5    19.181481
sensor6    19.437037
dtype: float64

In [16]:
average_temp_series = df.mean(axis=1)
print(average_temp_series)
print(average_temp_series[:8])

0     13.933333
1     14.533333
2     14.666667
3     14.900000
4     15.083333
5     15.116667
6     15.283333
7     15.116667
8     15.700000
9     16.116667
10    15.650000
11    16.500000
12    16.933333
13    17.133333
14    17.833333
15    18.750000
16    18.800000
17    19.466667
18    20.133333
19    21.050000
20    21.466667
21    22.800000
22    23.133333
23    24.266667
24    23.366667
25    23.666667
26    23.350000
27    23.283333
28    23.533333
29    22.833333
30    22.983333
31    22.400000
32    22.816667
33    22.166667
34    21.966667
35    21.533333
36    22.100000
37    21.550000
38    21.500000
39    21.433333
40    20.883333
41    20.783333
42    20.400000
43    20.666667
44    20.183333
45    20.116667
46    19.733333
47    20.216667
48    19.816667
49    19.533333
50    19.016667
51    19.050000
52    19.250000
53    19.116667
dtype: float64
0    13.933333
1    14.533333
2    14.666667
3    14.900000
4    15.083333
5    15.116667
6    15.283333
7    15.116667
dtype: float64

In [15]:
sensors = df.columns.values[1:]
# all columns except the time column will be removed:
df = df.drop(sensors, axis=1)
print(df[:5])

       time
0  06:00:00
1  06:15:00
2  06:30:00
3  06:45:00
4  07:00:00

In [17]:
# best practice:
df = df.assign(temperature=average_temp_series)  # inplace option not available
# alternatively:
#df.loc[:,"temperature"] = average_temp_series
df[:3]

       time  temperature
0  06:00:00    13.933333
1  06:15:00    14.533333
2  06:30:00    14.666667

In [18]:
temp_df = pd.read_csv("temperatures.csv",
                      sep=";",
                      index_col=0,
                      decimal=",")
print(temp_df)

          sensor1  sensor2  sensor3  sensor4  sensor5  sensor6
time
06:00:00     14.3     13.7     14.2     14.3     13.5     13.6
06:15:00     14.5     14.5     14.0     15.0     14.5     14.7
06:30:00     14.6     15.1     14.8     15.3     14.0     14.2
06:45:00     14.8     14.5     15.6     15.2     14.7     14.6
07:00:00     15.0     14.9     15.7     15.6     14.0     15.3
07:15:00     15.2     15.2     14.6     15.3     15.5     14.9
07:30:00     15.4     15.3     15.6     15.6     14.7     15.1
07:45:00     15.5     14.8     15.4     15.5     14.6     14.9
08:00:00     15.7     15.6     15.9     16.2     15.4     15.4
08:15:00     15.9     15.8     15.9     16.9     16.0     16.2
08:30:00     16.1     15.7     16.1     15.9     14.9     15.2
08:45:00     16.5     16.6     17.3     16.2     16.4     16.0
09:00:00     16.8     17.3     17.7     17.8     15.9     16.1
09:15:00     17.1     17.5     17.5     17.3     16.6     16.8
09:30:00     17.7     18.2     18.2     18.6     16.9     17.4
09:45:00     18.4     19.0     19.0     19.4     18.4     18.3
10:00:00     19.0     19.7     18.8     18.9     17.5     18.9
10:15:00     19.7     19.4     19.2     19.2     19.7     19.6
10:30:00     20.4     19.4     20.0     21.0     20.2     19.8
10:45:00     21.1     20.9     22.2     21.9     19.7     20.5
11:00:00     21.8     21.3     20.9     23.2     21.1     20.5
11:15:00     22.6     22.7     23.7     22.8     22.9     22.1
11:30:00     23.4     22.7     23.0     24.5     22.3     22.9
11:45:00     24.2     23.1     25.3     23.7     24.5     24.8
12:00:00     24.0     23.1     23.1     24.8     22.5     22.7
12:15:00     23.8     23.7     24.8     25.1     22.2     22.4
12:30:00     23.6     24.2     23.6     24.1     22.1     22.5
12:45:00     23.4     22.6     23.7     24.4     21.8     23.8
13:00:00     23.2     24.1     24.0     23.3     23.5     23.1
13:15:00     23.1     22.8     23.2     22.5     23.2     22.2
13:30:00     22.9     21.9     22.9     24.3     22.9     23.0
13:45:00     22.7     23.3     22.2     22.2     21.0     23.0
14:00:00     22.5     23.0     22.1     24.1     22.5     22.7
14:15:00     22.3     22.9     21.9     22.3     22.5     21.1
14:30:00     22.1     21.9     22.3     22.2     21.2     22.1
14:45:00     22.0     21.9     21.5     22.3     20.2     21.3
15:00:00     21.8     22.9     22.2     22.8     21.0     21.9
15:15:00     21.6     21.3     21.7     21.7     21.9     21.1
15:30:00     21.4     21.3     21.7     21.9     21.0     21.7
15:45:00     21.3     21.6     21.6     22.6     20.5     21.0
16:00:00     21.1     21.6     20.7     20.6     19.9     21.4
16:15:00     20.9     20.6     20.8     20.5     20.3     21.6
16:30:00     20.8     20.7     20.7     20.4     20.2     19.6
16:45:00     20.6     21.4     20.3     21.4     19.1     21.2
17:00:00     20.4     19.5     20.3     21.8     19.9     19.2
17:15:00     20.3     20.7     19.6     21.3     19.8     19.0
17:30:00     20.1     20.5     19.7     19.7     18.7     19.7
17:45:00     19.9     20.4     19.4     21.1     20.0     20.5
18:00:00     19.8     20.0     19.1     19.7     20.1     20.2
18:15:00     19.6     19.9     19.2     19.9     20.0     18.6
18:30:00     19.5     19.1     19.2     19.7     18.3     18.3
18:45:00     19.3     18.7     20.3     19.0     18.8     18.2
19:00:00     19.2     18.7     20.1     19.9     18.3     19.3
19:15:00     19.0     19.7     18.9     19.2     18.5     19.4

In [23]:
import numpy as np
A = np.random.randint(1, 30, (4, 2))
print(A)
df = pd.DataFrame(A, columns=['Foo', 'Bar'])
print(df)
m = df % 2 == 0
print(m)
df.where(m, -df, inplace=True)
print(df)

[[13  8]
 [11  6]
 [11  5]
 [16 18]]
   Foo  Bar
0   13    8
1   11    6
2   11    5
3   16   18
     Foo    Bar
0  False   True
1  False   True
2  False  False
3   True   True

   Foo  Bar
0  -13    8
1  -11    6
2  -11   -5
3   16   18

In [21]:
random_df = pd.DataFrame(np.random.random(size=temp_df.shape), 
                         columns=temp_df.columns.values, 
                         index=temp_df.index)
nan_df = pd.DataFrame(np.nan,
                      columns=temp_df.columns.values, 
                      index=temp_df.index)
df_bool = random_df<0.8
df_bool[:5]

          sensor1  sensor2  sensor3  sensor4  sensor5  sensor6
time
06:00:00     True    False    False     True     True     True
06:15:00    False     True     True     True    False     True
06:30:00     True     True     True     True     True     True
06:45:00     True     True    False     True     True     True
07:00:00     True     True     True     True     True     True

In [22]:
disturbed_data = temp_df.where(df_bool, nan_df)
disturbed_data.to_csv("temperatures_with_NaN.csv")
disturbed_data[:10]

          sensor1  sensor2  sensor3  sensor4  sensor5  sensor6
time
06:00:00     14.3      NaN      NaN     14.3     13.5     13.6
06:15:00      NaN     14.5     14.0     15.0      NaN     14.7
06:30:00     14.6     15.1     14.8     15.3     14.0     14.2
06:45:00     14.8     14.5      NaN     15.2     14.7     14.6
07:00:00     15.0     14.9     15.7     15.6     14.0     15.3
07:15:00     15.2     15.2     14.6     15.3     15.5     14.9
07:30:00      NaN      NaN     15.6     15.6     14.7     15.1
07:45:00     15.5     14.8     15.4     15.5     14.6      NaN
08:00:00     15.7      NaN     15.9     16.2      NaN      NaN
08:15:00     15.9     15.8     15.9      NaN      NaN     16.2

In [23]:
'''
Using dropna on the DataFrame
'dropna' is a DataFrame method. If we call this method without arguments, 
it will return an object where every row is ommitted, in which data are 
missing, i.e. some value is NaN:
'''
df = disturbed_data.dropna()
df

          sensor1  sensor2  sensor3  sensor4  sensor5  sensor6
time
06:30:00     14.6     15.1     14.8     15.3     14.0     14.2
07:00:00     15.0     14.9     15.7     15.6     14.0     15.3
07:15:00     15.2     15.2     14.6     15.3     15.5     14.9
09:00:00     16.8     17.3     17.7     17.8     15.9     16.1
09:15:00     17.1     17.5     17.5     17.3     16.6     16.8
09:30:00     17.7     18.2     18.2     18.6     16.9     17.4
10:00:00     19.0     19.7     18.8     18.9     17.5     18.9
10:15:00     19.7     19.4     19.2     19.2     19.7     19.6
12:45:00     23.4     22.6     23.7     24.4     21.8     23.8
13:45:00     22.7     23.3     22.2     22.2     21.0     23.0
14:15:00     22.3     22.9     21.9     22.3     22.5     21.1
14:30:00     22.1     21.9     22.3     22.2     21.2     22.1
16:30:00     20.8     20.7     20.7     20.4     20.2     19.6
17:00:00     20.4     19.5     20.3     21.8     19.9     19.2
17:45:00     19.9     20.4     19.4     21.1     20.0     20.5
19:00:00     19.2     18.7     20.1     19.9     18.3     19.3
19:15:00     19.0     19.7     18.9     19.2     18.5     19.4

In [24]:
'''
'dropna' can also be used to drop all columns in which some values are NaN. 
This can be achieved by assigning 1 to the axis parameter. The default 
value is False, as we have seen in our previous example. As every column 
from our sensors contain NaN values, they will all disappear:
'''
df = disturbed_data.dropna(axis=1)
df[:5]

Empty DataFrame
Columns: []
Index: [06:00:00, 06:15:00, 06:30:00, 06:45:00, 07:00:00]

In [25]:
'''
Let us change our task: We only want to get rid of all the rows, which 
contain more than one NaN value. The parameter 'thresh' is ideal for 
this task. It can be set to the minimum number. 'thresh' is set to an 
integer value, which defines the minimum number of non-NaN values. We 
have six temperature values in every row. Setting 'thresh' to 5 makes sure 
that we will have at least 5 valid floats in every remaining row:
'''
cleansed_df = disturbed_data.dropna(thresh=5, axis=0)
cleansed_df[:7]

          sensor1  sensor2  sensor3  sensor4  sensor5  sensor6
time
06:30:00     14.6     15.1     14.8     15.3     14.0     14.2
06:45:00     14.8     14.5      NaN     15.2     14.7     14.6
07:00:00     15.0     14.9     15.7     15.6     14.0     15.3
07:15:00     15.2     15.2     14.6     15.3     15.5     14.9
07:45:00     15.5     14.8     15.4     15.5     14.6      NaN
08:45:00     16.5     16.6     17.3     16.2     16.4      NaN
09:00:00     16.8     17.3     17.7     17.8     15.9     16.1

In [26]:
average_temp_series = cleansed_df.mean(axis=1)
sensors = cleansed_df.columns.values
df = cleansed_df.drop(sensors, axis=1)
# best practice:
df = df.assign(temperature=average_temp_series)  # inplace option not available
df[:6]

          temperature
time
06:30:00    14.666667
06:45:00    14.760000
07:00:00    15.083333
07:15:00    15.116667
07:45:00    15.160000
08:45:00    16.600000

In [27]:
'''
Binning in Python and Pandas
Introduction
Data binning, which is also known as bucketing or discretization, is a 
technique used in data processing and statistics. Binning can be used 
for example, if there are more possible data points than observed data 
points. An example is to bin the body heights of people into intervals 
or categories. Let us assume, we take the heights of 30 people. The length 
values can be between - roughly guessing - 1.30 metres to 2.50 metres. 
Theoretically, there are 120 different cm values possible, but we can have 
at most 30 different values from our sample group. One way to group them 
could be to put the measured values into bins ranging from 1.30 - 1.50 metres, 
1.50 - 1.70 metres, 1.70 - 1.90 metres and so on. This means that the 
original data values, will be assigned to a bin into wich they fit 
according to their size. The original values will be replaced by values 
representing the corresponding intervals. Binning is a form of quantization. 

Bins do not necessarily have to be numerical, they can be categorical 
values of any kind, like "dogs", "cats", "hamsters", and so on. 

Binning is also used in image processing, binning. It can be used to reduce 
the amount of data, by combining neighboring pixel into single pixels. 
kxk binning reduces areas of k x k pixels into single pixel.
Pandas provides easy ways to create bins and to bin data. Before we describe 
these Pandas functionalities, we will introduce basic Python functions, 
working on Python lists and tuples.

Binning in Python
The following Python function can be used to create bins.
'''
def create_bins(lower_bound, width, quantity):
    """ create_bins returns an equal-width (distance) partitioning. 
        It returns an ascending list of tuples, representing the intervals.
        A tuple bins[i], i.e. (bins[i][0], bins[i][1])  with i > 0 
        and i < quantity, satisfies the following conditions:
            (1) bins[i][0] + width == bins[i][1]
            (2) bins[i-1][0] + width == bins[i][0] and
                bins[i-1][1] + width == bins[i][1]
    """
    
    bins = []
    for low in range(lower_bound, 
                     lower_bound + quantity*width + 1, width):
        bins.append((low, low+width))
    return bins
bins = create_bins(lower_bound=10,
                   width=10,
                   quantity=5)
bins

[(10, 20), (20, 30), (30, 40), (40, 50), (50, 60), (60, 70)]

In [28]:
'''
The next function 'find_bin' is called with a list or tuple of bin 'bins', 
which have to be two-tuples or lists of two elements. The function finds 
the index of the interval, where the value 'value' is contained:'''

def find_bin(value, bins):
    """ bins is a list of tuples, like [(0,20), (20, 40), (40, 60)],
        binning returns the smallest index i of bins so that
        bin[i][0] <= value < bin[i][1]
    """
    
    for i in range(0, len(bins)):
        if bins[i][0] <= value < bins[i][1]:
            return i
    return -1
from collections import Counter
bins = create_bins(lower_bound=50,
                   width=4,
                   quantity=10)
print(bins)
weights_of_persons = [73.4, 69.3, 64.9, 75.6, 74.9, 80.3, 
                      78.6, 84.1, 88.9, 90.3, 83.4, 69.3, 
                      52.4, 58.3, 67.4, 74.0, 89.3, 63.4]
binned_weights = []
for value in weights_of_persons:
    bin_index = find_bin(value, bins)
    print(value, bin_index, bins[bin_index])
    binned_weights.append(bin_index)
    
frequencies = Counter(binned_weights)
print(frequencies)

[(50, 54), (54, 58), (58, 62), (62, 66), (66, 70), (70, 74), (74, 78), (78, 82), (82, 86), (86, 90), (90, 94)]
73.4 5 (70, 74)
69.3 4 (66, 70)
64.9 3 (62, 66)
75.6 6 (74, 78)
74.9 6 (74, 78)
80.3 7 (78, 82)
78.6 7 (78, 82)
84.1 8 (82, 86)
88.9 9 (86, 90)
90.3 10 (90, 94)
83.4 8 (82, 86)
69.3 4 (66, 70)
52.4 0 (50, 54)
58.3 2 (58, 62)
67.4 4 (66, 70)
74.0 6 (74, 78)
89.3 9 (86, 90)
63.4 3 (62, 66)
Counter({4: 3, 6: 3, 3: 2, 7: 2, 8: 2, 9: 2, 5: 1, 10: 1, 0: 1, 2: 1})

In [30]:
'''
Binning with Pandas
The module Pandas of Python provides powerful functionalities for the 
binning of data. We will demonstrate this by using our previous data.
Bins used by Pandas
We used a list of tuples as bins in our previous example. We have to 
turn this list into a usable data structure for the pandas function 
"cut". This data structure is an IntervalIndex. We can do this with 
pd.IntervalIndex.from_tuples:'''
import pandas as pd
bins2 = pd.IntervalIndex.from_tuples(bins)
'''
cut" is the name of the Pandas function, which is needed to bin values 
into bins. "cut" takes many parameters but the most important ones are 
"x" for the actual values und "bins", defining the IntervalIndex. "x" 
can be any 1-dimensional array-like structure, e.g. tuples, lists, 
nd-arrays and so on:'''
categorical_object = pd.cut(weights_of_persons, bins2)
print(categorical_object)

[(70, 74], (66, 70], (62, 66], (74, 78], (74, 78], ..., (58, 62], (66, 70], (70, 74], (86, 90], (62, 66]]
Length: 18
Categories (11, interval[int64]): [(50, 54] < (54, 58] < (58, 62] < (62, 66] ... (78, 82] < (82, 86] < (86, 90] < (90, 94]]

In [31]:
'''
The result of the Pandas function "cut" is a so-called "Categorical 
object". Each bin is a category. The categories are described in a 
mathematical notation. "(70, 74]" means that this bins contains values 
from 70 to 74 whereas 70 is not included but 74 is included. 
Mathematically, this is a half-open interval, i.e. nn interval in which 
one endpoint is included but not the other. Sometimes it is also called 
an half-closed interval. 
We had also defined the bins in our previous chapter as half-open intervals, 
but the other way round, i.e. left side closed and the right side open. 
When we used pd.IntervalIndex.from_tuples, we could have defined the 
"openness" of this bins by setting the parameter "closed" to one of 
the values:

'left': closed on the left side and open on the right
'right': (The default) open on the left side and closed on the right
'both': closed on both sides
'neither': open on both sides

To have the same behaviour as in our previous chapter, we will set the
parameter closed to "left":
'''
bins2 = pd.IntervalIndex.from_tuples(bins, closed="left")
categorical_object = pd.cut(weights_of_persons, bins2)
print(categorical_object)

[[70, 74), [66, 70), [62, 66), [74, 78), [74, 78), ..., [58, 62), [66, 70), [74, 78), [86, 90), [62, 66)]
Length: 18
Categories (11, interval[int64]): [[50, 54) < [54, 58) < [58, 62) < [62, 66) ... [78, 82) < [82, 86) < [86, 90) < [90, 94)]

In [32]:
pd.value_counts(categorical_object)

[74, 78)    3
[66, 70)    3
[86, 90)    2
[82, 86)    2
[78, 82)    2
[62, 66)    2
[90, 94)    1
[70, 74)    1
[58, 62)    1
[50, 54)    1
[54, 58)    0
dtype: int64

In [33]:
labels = categorical_object.codes
labels

array([ 5,  4,  3,  6,  6,  7,  7,  8,  9, 10,  8,  4,  0,  2,  4,  6,  9,
        3], dtype=int8)

In [34]:
categories = categorical_object.categories
categories

IntervalIndex([[50, 54), [54, 58), [58, 62), [62, 66), [66, 70) ... [74, 78), [78, 82), [82, 86), [86, 90), [90, 94)]
              closed='left',
              dtype='interval[int64]')

In [35]:
for index in range(len(weights_of_persons)):
    label_index = labels[index]
    print(weights_of_persons[index], label_index, categories[label_index] )

73.4 5 [70, 74)
69.3 4 [66, 70)
64.9 3 [62, 66)
75.6 6 [74, 78)
74.9 6 [74, 78)
80.3 7 [78, 82)
78.6 7 [78, 82)
84.1 8 [82, 86)
88.9 9 [86, 90)
90.3 10 [90, 94)
83.4 8 [82, 86)
69.3 4 [66, 70)
52.4 0 [50, 54)
58.3 2 [58, 62)
67.4 4 [66, 70)
74.0 6 [74, 78)
89.3 9 [86, 90)
63.4 3 [62, 66)

In [36]:
categorical_object.categories

IntervalIndex([[50, 54), [54, 58), [58, 62), [62, 66), [66, 70) ... [74, 78), [78, 82), [82, 86), [86, 90), [90, 94)]
              closed='left',
              dtype='interval[int64]')

In [37]:
'''
Multi-level Indexing
'''
import pandas as pd
cities = ["Vienna", "Vienna", "Vienna",
          "Hamburg", "Hamburg", "Hamburg",
          "Berlin", "Berlin", "Berlin",
          "Zürich", "Zürich", "Zürich"]
index = [cities, ["country", "area", "population",
                  "country", "area", "population",
                  "country", "area", "population",
                  "country", "area", "population"]]
print(index)

[['Vienna', 'Vienna', 'Vienna', 'Hamburg', 'Hamburg', 'Hamburg', 'Berlin', 'Berlin', 'Berlin', 'Zürich', 'Zürich', 'Zürich'], ['country', 'area', 'population', 'country', 'area', 'population', 'country', 'area', 'population', 'country', 'area', 'population']]

In [38]:
data = ["Austria", 414.60,    1805681,
        "Germany", 755.00,    1760433,
        "Germany", 891.85,    3562166,
        "Switzerland", 87.88, 378884]
city_series = pd.Series(data, index=index)
print(city_series)

Vienna   country           Austria
         area                414.6
         population        1805681
Hamburg  country           Germany
         area                  755
         population        1760433
Berlin   country           Germany
         area               891.85
         population        3562166
Zürich   country       Switzerland
         area                87.88
         population         378884
dtype: object

In [39]:
print(city_series["Vienna"])

country       Austria
area            414.6
population    1805681
dtype: object

In [40]:
print(city_series["Vienna"]["area"])

414.6

In [41]:
print(city_series["Vienna", "area"])

414.6

In [42]:
city_series["Hamburg",:]

country       Germany
area              755
population    1760433
dtype: object

In [43]:
city_series = city_series.sort_index()
print("city_series with sorted index:")
print(city_series)
print("\n\nSlicing the city_series:")
city_series["Berlin":"Vienna"]

city_series with sorted index:
Berlin   area               891.85
         country           Germany
         population        3562166
Hamburg  area                  755
         country           Germany
         population        1760433
Vienna   area                414.6
         country           Austria
         population        1805681
Zürich   area                87.88
         country       Switzerland
         population         378884
dtype: object


Slicing the city_series:

Berlin   area           891.85
         country       Germany
         population    3562166
Hamburg  area              755
         country       Germany
         population    1760433
Vienna   area            414.6
         country       Austria
         population    1805681
dtype: object

In [44]:
print(city_series[:, "area"])

Berlin     891.85
Hamburg       755
Vienna      414.6
Zürich      87.88
dtype: object

In [2]:
import pandas as pd
population_dict = {'California': 38332521,
'Texas': 26448193,
'New York': 19651127,
'Florida': 19552860,
'Illinois': 12882135}
population = pd.Series(population_dict)
population

California    38332521
Texas         26448193
New York      19651127
Florida       19552860
Illinois      12882135
dtype: int64

In [3]:
population['California']
#population.California

38332521

In [4]:
population['California':'Illinois']
#population[:3]

California    38332521
Texas         26448193
New York      19651127
Florida       19552860
Illinois      12882135
dtype: int64

In [5]:
pd.Series(5, index=[100, 200, 300])

100    5
200    5
300    5
dtype: int64

In [6]:
pd.Series({2:'a', 1:'b', 3:'c'})

2    a
1    b
3    c
dtype: object

In [7]:
pd.Series({2:'a', 1:'b', 3:'c'}, index=[1, 2])

1    b
2    a
dtype: object

In [8]:
area_dict = {'California': 423967, 'Texas': 695662, 'New York': 141297,
'Florida': 170312, 'Illinois': 149995}
area = pd.Series(area_dict)
area

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
dtype: int64

In [9]:
states = pd.DataFrame({'population': population,
'area': area})
states

            population    area
California    38332521  423967
Texas         26448193  695662
New York      19651127  141297
Florida       19552860  170312
Illinois      12882135  149995

In [10]:
states.index

Index(['California', 'Texas', 'New York', 'Florida', 'Illinois'], dtype='object')

In [11]:
states.columns

Index(['population', 'area'], dtype='object')

In [11]:
'''Constructing DataFrame objects'''
#From a single Series object. A DataFrame is a collection of Series objects, and a singlecolumn
#DataFrame can be constructed from a single Series:
pd.DataFrame(population, columns=['population'])

            population
California    38332521
Texas         26448193
New York      19651127
Florida       19552860
Illinois      12882135

In [14]:
'''From a list of dicts. Any list of dictionaries can be made into a DataFrame. We’ll use a
simple list comprehension to create some data:'''
data = [{'a': i, 'b': 2 * i} for i in range(3)]
pd.DataFrame(data,index=['c','d','e'])

   a  b
c  0  0
d  1  2
e  2  4

In [14]:
pd.DataFrame([{'a': 1, 'b': 2}, {'b': 3, 'c': 4}])

     a  b    c
0  1.0  2  NaN
1  NaN  3  4.0

In [15]:
'''From a dictionary of Series objects. As we saw before, a DataFrame can be constructed
from a dictionary of Series objects as well:'''
pd.DataFrame({'population': population,
'area': area})

            population    area
California    38332521  423967
Texas         26448193  695662
New York      19651127  141297
Florida       19552860  170312
Illinois      12882135  149995

In [16]:
'''From a two-dimensional NumPy array. Given a two-dimensional array of data, we can
create a DataFrame with any specified column and index names. If omitted, an integer
index will be used for each:'''
import numpy as np
pd.DataFrame(np.random.rand(3, 2),columns=['foo', 'bar'],index=['a', 'b', 'c'])

        foo       bar
a  0.531673  0.131051
b  0.289906  0.364561
c  0.796578  0.763936

In [12]:
'''From a NumPy structured array'''
import numpy as np
import pandas as pd
A = np.zeros(3, dtype=[('A', 'i8'), ('B', 'f8')])
A

array([(0, 0.), (0, 0.), (0, 0.)], dtype=[('A', '<i8'), ('B', '<f8')])

In [13]:
pd.DataFrame(A)

   A    B
0  0  0.0
1  0  0.0
2  0  0.0

In [20]:
'''
The Pandas Index Object
Both the Series and DataFrame objects contain an explicit
index that lets you reference and modify data. This Index object is an 
interesting structure in itself, and it can be thought of either as an 
immutable array or as an ordered set (technically a multiset, as Index 
objects may contain repeated values).Those views have some interesting 
consequences in the operations available on Index objects.'''
ind = pd.Index([2, 3, 5, 7, 11])
ind

Int64Index([2, 3, 5, 7, 11], dtype='int64')

In [21]:
ind[1]

3

In [22]:
ind[::2]

Int64Index([2, 5, 11], dtype='int64')

In [23]:
print(ind.size, ind.shape, ind.ndim, ind.dtype)

5 (5,) 1 int64

In [24]:
ind[1] = 0

TypeError: Index does not support mutable operations

In [25]:
indA = pd.Index([1, 3, 5, 7, 9])
indB = pd.Index([2, 3, 5, 7, 11])

In [26]:
indA & indB # intersection

Int64Index([3, 5, 7], dtype='int64')

In [27]:
indA | indB # union

Int64Index([1, 2, 3, 5, 7, 9, 11], dtype='int64')

In [28]:
indA ^ indB # symmetric difference

Int64Index([1, 2, 9, 11], dtype='int64')

In [15]:
'''Data Selection in Series'''
import pandas as pd
data = pd.Series([0.25, 0.5, 0.75, 1.0],index=['a', 'b', 'c', 'd'])
data

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

In [30]:
data['b']

0.5

In [31]:
'a' in data

True

In [32]:
data.keys()

Index(['a', 'b', 'c', 'd'], dtype='object')

In [33]:
list(data.items())

[('a', 0.25), ('b', 0.5), ('c', 0.75), ('d', 1.0)]

In [34]:
data['e'] = 1.25
data

a    0.25
b    0.50
c    0.75
d    1.00
e    1.25
dtype: float64

In [35]:
'''Series as one-dimensional array'''
data['a':'c']

a    0.25
b    0.50
c    0.75
dtype: float64

In [36]:
# slicing by implicit integer index
data[0:2]

a    0.25
b    0.50
dtype: float64

In [25]:
'''print(data[(data>0.3) & (data< 0.8)])
print(data.max())
print(data[data==(data.max())])'''
t=data==data.max()
print(t)
print(data[t])

a    False
b    False
c    False
d     True
dtype: bool
d    1.0
dtype: float64

In [45]:
# fancy indexing
data[['a', 'e']]

a    0.25
e    1.25
dtype: float64

In [26]:
'''
Indexers: loc, iloc, and ix
These slicing and indexing conventions can be a source of confusion. For 
example, if your Series has an explicit integer index, an indexing 
operation such as data[1] will use the explicit indices, while a slicing 
operation like data[1:3] will use the implicit Python-style index.
'''
data = pd.Series(['a', 'b', 'c'], index=[1, 3, 5])
data

1    a
3    b
5    c
dtype: object

In [28]:
# explicit index when indexing
data[3]

'b'

In [48]:
# implicit index when slicing
data[1:3]

3    b
5    c
dtype: object

In [49]:
'''the loc attribute allows indexing and slicing that always references 
the explicit index.'''
data.loc[1]

'a'

In [50]:
data.loc[1:3]

1    a
3    b
dtype: object

In [51]:
'''The iloc attribute allows indexing and slicing that always references the 
implicit Python-style index:'''
data.iloc[1]

'b'

In [52]:
data.iloc[1:3]

3    b
5    c
dtype: object

In [22]:
'''Data Selection in DataFrame'''
import pandas as pd
area = pd.Series({'California': 423967, 'Texas': 695662,
'New York': 141297, 'Florida': 170312,
'Illinois': 149995})
pop = pd.Series({'California': 38332521, 'Texas': 26448193,
'New York': 19651127, 'Florida': 19552860,
'Illinois': 12882135})
data = pd.DataFrame({'area':area, 'pop':pop})
data

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127
Florida     170312  19552860
Illinois    149995  12882135

In [54]:
data['area']

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

In [55]:
data.area

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

In [56]:
data.area is data['area']

True

In [23]:
data['density'] = data['pop'] / data['area']
data

              area       pop     density
California  423967  38332521   90.413926
Texas       695662  26448193   38.018740
New York    141297  19651127  139.076746
Florida     170312  19552860  114.806121
Illinois    149995  12882135   85.883763

In [63]:
#DataFrame as two-dimensional array
data.values

array([[4.23967000e+05, 3.83325210e+07, 9.04139261e+01],
       [6.95662000e+05, 2.64481930e+07, 3.80187404e+01],
       [1.41297000e+05, 1.96511270e+07, 1.39076746e+02],
       [1.70312000e+05, 1.95528600e+07, 1.14806121e+02],
       [1.49995000e+05, 1.28821350e+07, 8.58837628e+01]])

In [64]:
data

              area       pop     density
California  423967  38332521   90.413926
Texas       695662  26448193   38.018740
New York    141297  19651127  139.076746
Florida     170312  19552860  114.806121
Illinois    149995  12882135   85.883763

In [65]:
data.T

           California         Texas      New York       Florida      Illinois
area     4.239670e+05  6.956620e+05  1.412970e+05  1.703120e+05  1.499950e+05
pop      3.833252e+07  2.644819e+07  1.965113e+07  1.955286e+07  1.288214e+07
density  9.041393e+01  3.801874e+01  1.390767e+02  1.148061e+02  8.588376e+01

In [66]:
data

              area       pop     density
California  423967  38332521   90.413926
Texas       695662  26448193   38.018740
New York    141297  19651127  139.076746
Florida     170312  19552860  114.806121
Illinois    149995  12882135   85.883763

In [13]:
data.values[0]

array([4.23967000e+05, 3.83325210e+07, 9.04139261e+01])

In [75]:
'''Using the iloc indexer, we can index the underlying array as if it is a 
simple NumPy array (using the implicit Python-style index), but the DataFrame 
index and column labels are maintained in the result:'''
data.iloc[:3, :2]

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127

In [76]:
data.loc[:'Illinois', :'pop']

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127
Florida     170312  19552860
Illinois    149995  12882135

In [80]:
'''The ix indexer allows a hybrid of these two approaches'''
print(data.ix[:3, :'pop'])

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127

c:\users\lalit jangid\appdata\local\programs\python\python37\lib\site-packages\ipykernel_launcher.py:2: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated

In [17]:
#data[data.density > 100]
data.loc[data.density>100]

            area       pop     density
New York  141297  19651127  139.076746
Florida   170312  19552860  114.806121

In [42]:
data.loc[data.density > 100,['pop']]

               pop
New York  19651127
Florida   19552860

In [83]:
data.loc[data.density > 100,['pop','density']]

               pop     density
New York  19651127  139.076746
Florida   19552860  114.806121

In [24]:
#data.loc['California', 'density'] = 90
data.iloc[0,2] = 90
data

              area       pop     density
California  423967  38332521   90.000000
Texas       695662  26448193   38.018740
New York    141297  19651127  139.076746
Florida     170312  19552860  114.806121
Illinois    149995  12882135   85.883763

In [88]:
data.iloc[0:2]

              area       pop   density
California  423967  38332521  90.00000
Texas       695662  26448193  38.01874

In [89]:
data.iloc[0:4,1]

California    38332521
Texas         26448193
New York      19651127
Florida       19552860
Name: pop, dtype: int64

In [90]:
data.iloc[0:2,0:2]

              area       pop
California  423967  38332521
Texas       695662  26448193

In [91]:
'''Additional indexing conventions'''
#indexing refers to columns, slicing refers to rows
data['Florida':'Illinois']

            area       pop     density
Florida   170312  19552860  114.806121
Illinois  149995  12882135   85.883763

In [92]:
data[1:3]

            area       pop     density
Texas     695662  26448193   38.018740
New York  141297  19651127  139.076746

In [27]:
'''
Ufuncs: Index Preservation
Because Pandas is designed to work with NumPy, any NumPy ufunc will work on
Pandas Series and DataFrame objects.
'''
import pandas as pd
import numpy as np
rng = np.random.RandomState(4)
ser = pd.Series(rng.randint(0, 10, 4))
ser

0    7
1    5
2    1
3    8
dtype: int32

In [9]:
df = pd.DataFrame(rng.randint(0, 10, (3, 4)),
columns=['A', 'B', 'C', 'D'])
df

   A  B  C  D
0  6  9  2  6
1  7  4  3  7
2  7  2  5  4

In [10]:
np.exp(ser)

0     403.428793
1      20.085537
2    1096.633158
3      54.598150
dtype: float64

In [11]:
np.sin(df * np.pi / 4)

          A             B         C             D
0 -1.000000  7.071068e-01  1.000000 -1.000000e+00
1 -0.707107  1.224647e-16  0.707107 -7.071068e-01
2 -0.707107  1.000000e+00 -0.707107  1.224647e-16

In [12]:
'''Index alignment in Series'''
area = pd.Series({'Alaska': 1723337, 'Texas': 695662,
'California': 423967}, name='area')
population = pd.Series({'California': 38332521, 'Texas': 26448193,
'New York': 19651127}, name='population')

In [13]:
population / area

Alaska              NaN
California    90.413926
New York            NaN
Texas         38.018740
dtype: float64

In [14]:
area.index | population.index

Index(['Alaska', 'California', 'New York', 'Texas'], dtype='object')

In [15]:
A = pd.Series([2, 4, 6], index=[0, 1, 2])
B = pd.Series([1, 3, 5], index=[1, 2, 3])
A + B

0    NaN
1    5.0
2    9.0
3    NaN
dtype: float64

In [16]:
A.add(B, fill_value=0)

0    2.0
1    5.0
2    9.0
3    5.0
dtype: float64

In [3]:
'''Index alignment in DataFrame'''
import pandas as pd
import numpy as np
rng=np.random.RandomState(2)
A = pd.DataFrame(rng.randint(0, 20, (2, 2)),
columns=list('AB'))
A

    A   B
0   8  15
1  13   8

In [4]:
B = pd.DataFrame(rng.randint(0, 10, (3, 3)),
columns=list('BAC'))
B

   B  A  C
0  6  2  8
1  7  2  1
2  5  4  4

In [5]:
A+B

      A     B   C
0  10.0  21.0 NaN
1  15.0  15.0 NaN
2   NaN   NaN NaN

In [6]:
fill = A.stack().mean()
print(A.add(B, fill_value=fill))
print(A.stack().mean())
print(A.stack())

      A     B     C
0  10.0  21.0  19.0
1  15.0  15.0  12.0
2  15.0  16.0  15.0
11.0
0  A     8
   B    15
1  A    13
   B     8
dtype: int32

In [7]:
A = rng.randint(10, size=(3, 4))
A

array([[5, 7, 3, 6],
       [4, 3, 7, 6],
       [1, 3, 5, 8]])

In [27]:
A - A[0]

array([[ 0,  0,  0,  0],
       [-1, -2,  2,  4],
       [ 3, -7,  1,  4]])

In [9]:
'''the convention similarly operates row-wise'''
import pandas as pd
df = pd.DataFrame(A, columns=list('QRST'))
print(df - df.iloc[0])
print(df)

   Q  R  S  T
0  0  0  0  0
1 -1 -4  4  0
2 -4 -4  2  2
   Q  R  S  T
0  5  7  3  6
1  4  3  7  6
2  1  3  5  8

In [30]:
'''If you would instead like to operate column-wise, you can 
use the object methods mentioned earlier, while specifying 
the axis keyword:'''
df.subtract(df['R'], axis=0)

   Q  R  S  T
0 -5  0 -6 -4
1 -4  0 -2  2
2  5  0  2  7

In [11]:
halfrow = df.iloc[0, ::2]
print(type(halfrow))
print(halfrow)

<class 'pandas.core.series.Series'>
Q    5
S    3
Name: 0, dtype: int32

In [32]:
df - halfrow

     Q   R    S   T
0  0.0 NaN  0.0 NaN
1 -1.0 NaN  2.0 NaN
2  3.0 NaN  1.0 NaN

In [33]:
'''NaN and None in Pandas
NaN and None both have their place, and Pandas is built to handle 
the two of them nearly interchangeably, converting between 
them where  appropriate:'''
pd.Series([1, np.nan, 2, None])

0    1.0
1    NaN
2    2.0
3    NaN
dtype: float64

In [34]:
x = pd.Series(range(2), dtype=int)
x

0    0
1    1
dtype: int32

In [35]:
x[0] = None
x

0    NaN
1    1.0
dtype: float64

In [16]:
'''Pandas handling of NAs by type
Typeclass        Conversion when storing NAs    NA sentinel value
floating         No change                      np.nan
object           No change                      None or np.nan
integer          Cast to float64                np.nan
boolean          Cast to object                 None or np.nan
Keep in mind that in Pandas, string data is always stored with an
object dtype.'''
'''
Operating on Null Values
Pandas treats None and NaN as essentially interchangeable 
for indicating missing or null values. To facilitate this 
convention,  there are several useful methods for detecting, 
removing, and replacing null values in Pandas data structures.
'''
'''
Operating on Null Values
Pandas treats None and NaN as essentially interchangeable 
for indicating missing or null values.
isnull()
Generate a Boolean mask indicating missing values

notnull()
Opposite of isnull()

dropna()
Return a filtered version of the data

fillna()
Return a copy of the data with missing values filled or imputed

Detecting null values
Pandas data structures have two useful methods for detecting null 
data: 
isnull() and notnull(). Either one will return a Boolean mask 
over the data.
'''
import pandas as pd
import numpy as np
data = pd.Series([1, np.nan, 'hello', None])
print(data)
print(data.isnull())
print(data[data.isnull()])

0        1
1      NaN
2    hello
3     None
dtype: object
0    False
1     True
2    False
3     True
dtype: bool
1     NaN
3    None
dtype: object

In [15]:
print(data.notnull())
print(data[data.notnull()])

0     True
1    False
2     True
3    False
dtype: bool
0        1
2    hello
dtype: object

In [5]:
'''Dropping null values
In addition to the masking used before, there are the 
convenience methods,  dropna() (which removes NA values) and 
fillna() (which fills in NA values).'''
data.dropna()

0        1
2    hello
dtype: object

In [19]:
df = pd.DataFrame([[1, np.nan, 2],
[2, 3,6],
[np.nan,4, 6]])
print(df)
print(df.dropna())

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  6
2  NaN  4.0  6
     0    1  2
1  2.0  3.0  6

In [20]:
'''
We cannot drop single values from a DataFrame; we can only 
drop full rows or full columns. Depending on the application, 
you might want one or the other, so  dropna() gives a number 
of options for a DataFrame.
'''
df.dropna()

     0    1  2
1  2.0  3.0  6

In [21]:
'''axis=1 drops all columns containing a null value'''
df.dropna(axis='columns')

   2
0  2
1  6
2  6

In [23]:
'''
But this drops some good data as well; you might rather be interested 
in dropping rows or columns with all NA values, or a majority of NA 
values. This can be specified through the how or thresh parameters, which 
allow fine control of the number of nulls to allow through.
The default is how='any', such that any row or column (depending on the 
axis keyword) containing a null value will be dropped. You can also 
specify how='all', which will only drop rows/columns that are all null 
values:
'''
df[3] = np.nan
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  6 NaN
2  NaN  4.0  6 NaN

In [24]:
df.dropna(axis='columns', how='all')

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  6
2  NaN  4.0  6

In [28]:
'''the thresh parameter lets you specify a minimum number
of non-null values for the row/column to be kept:'''
df.dropna(axis='rows',thresh=3)

     0    1  2   3
1  2.0  3.0  6 NaN

In [29]:
'''Filling null values
 You could do this in-place using the isnull() method as a mask, but 
 because it is such a common operation Pandas provides the fillna() 
 method, which returns a copy of the array with the null values
replaced.'''
import pandas as pd
import numpy as np
data = pd.Series([1, np.nan, 2, None, 3], index=list('abcde'))
data

a    1.0
b    NaN
c    2.0
d    NaN
e    3.0
dtype: float64

In [30]:
data.fillna(0)

a    1.0
b    0.0
c    2.0
d    0.0
e    3.0
dtype: float64

In [31]:
'''We can specify a forward-fill to propagate the previous value forward:'''
data.fillna(method='ffill')

a    1.0
b    1.0
c    2.0
d    2.0
e    3.0
dtype: float64

In [32]:
'''Or we can specify a back-fill to propagate the next values backward:'''
data.fillna(method='bfill')

a    1.0
b    2.0
c    2.0
d    3.0
e    3.0
dtype: float64

In [33]:
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  6 NaN
2  NaN  4.0  6 NaN

In [4]:
#df[3]=np.nan

In [34]:
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  6 NaN
2  NaN  4.0  6 NaN

In [36]:
df.fillna(method='ffill',axis=1)

     0    1    2    3
0  1.0  1.0  2.0  2.0
1  2.0  3.0  6.0  6.0
2  NaN  4.0  6.0  6.0

In [37]:
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  6 NaN
2  NaN  4.0  6 NaN

In [13]:
df.fillna(method='bfill', axis=1)

     0    1    2   3
0  1.0  2.0  2.0 NaN
1  2.0  3.0  6.0 NaN
2  4.0  4.0  6.0 NaN

In [14]:
'''Hierarchical Indexing
Higher-dimensional data can be compactly represented within the familiar 
one-dimensional Series and two-dimensional DataFrame objects.'''
import pandas as pd
import numpy as np

In [1]:
'''A Multiply Indexed Series
The bad way'''
import pandas as pd
index = [('California', 2000), ('California', 2010),
('New York', 2000), ('New York', 2010),
('Texas', 2000), ('Texas', 2010)]
populations = [33871648, 37253956,
18976457, 19378102,
20851820, 25145561]
pop = pd.Series(populations, index=index)
pop

(California, 2000)    33871648
(California, 2010)    37253956
(New York, 2000)      18976457
(New York, 2010)      19378102
(Texas, 2000)         20851820
(Texas, 2010)         25145561
dtype: int64

In [7]:
print(pop[[i for i in pop.index if i[1] == 2010]])
'''t=[i for i in pop.index if i[1] == 2010]
print(t)
pop[('California', 2010)]'''

(California, 2010)    37253956
(New York, 2010)      19378102
(Texas, 2010)         25145561
dtype: int64

"t=[i for i in pop.index if i[1] == 2010]\nprint(t)\npop[('California', 2010)]"

In [2]:
'''The better way: Pandas MultiIndex
Fortunately, Pandas provides a better way. Our tuple-based indexing is 
essentially a rudimentary multi-index, and the Pandas MultiIndex type 
gives us the type of operations we wish to have. We can create a 
multi-index from the tuples as follows:'''
index = pd.MultiIndex.from_tuples(index)
index

MultiIndex(levels=[['California', 'New York', 'Texas'], [2000, 2010]],
           labels=[[0, 0, 1, 1, 2, 2], [0, 1, 0, 1, 0, 1]])

In [3]:
'''If we reindex our series with this MultiIndex, we see the hierarchical 
representation of the data:'''
pop = pop.reindex(index)
pop

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [12]:
pop[:, 2010]

California    37253956
New York      19378102
Texas         25145561
dtype: int64

In [13]:
'''The unstack() method will quickly convert a multiplyindexed
Series into a conventionally indexed DataFrame:'''
pop_df = pop.unstack()
pop_df

                2000      2010
California  33871648  37253956
New York    18976457  19378102
Texas       20851820  25145561

In [14]:
pop_df.stack()

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [15]:
'''we might want to add another column of demographic data for each state 
at each year (say, population under 18); with a MultiIndex this is as 
easy as adding another column to the DataFrame:'''
pop_df = pd.DataFrame({'total': pop,'under18': [9267089, 9284094,
4687374, 4318033,
5906301, 6879014]})
pop_df

                    total  under18
California 2000  33871648  9267089
           2010  37253956  9284094
New York   2000  18976457  4687374
           2010  19378102  4318033
Texas      2000  20851820  5906301
           2010  25145561  6879014

In [21]:
'''pop_df['f_u18'] = pop_df['under18'] / pop_df['total']
pop_df'''
f_u18 = pop_df['under18'] / pop_df['total']
print(f_u18)

California  2000    0.273594
            2010    0.249211
New York    2000    0.247010
            2010    0.222831
Texas       2000    0.283251
            2010    0.273568
dtype: float64

In [22]:
f_u18.unstack()

                2000      2010
California  0.273594  0.249211
New York    0.247010  0.222831
Texas       0.283251  0.273568

In [26]:
'''Methods of MultiIndex Creation'''
df = pd.DataFrame(np.random.rand(4, 2),
index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
columns=['data1', 'data2'])
df

        data1     data2
a 1  0.163066  0.923883
  2  0.983535  0.787753
b 1  0.590573  0.572481
  2  0.239766  0.930706

In [10]:
data = {('California', 2000): 33871648,
('California', 2010): 37253956,
('Texas', 2000): 20851820,
('Texas', 2010): 25145561,
('New York', 2000): 18976457,
('New York', 2010): 19378102}
pd.Series(data)

California  2000    33871648
            2010    37253956
Texas       2000    20851820
            2010    25145561
New York    2000    18976457
            2010    19378102
dtype: int64

In [28]:
'''Explicit MultiIndex constructors
For more flexibility in how the index is constructed, you can instead 
use the class method constructors available in the pd.MultiIndex. 
you can construct the MultiIndex from a simple list of arrays, giving 
the index values within each level:'''
pd.MultiIndex.from_arrays([['a', 'a', 'b', 'b'], [1, 2, 1, 2]])

MultiIndex(levels=[['a', 'b'], [1, 2]],
           labels=[[0, 0, 1, 1], [0, 1, 0, 1]])

In [29]:
pd.MultiIndex.from_tuples([('a', 1), ('a', 2), ('b', 1), ('b', 2)])

MultiIndex(levels=[['a', 'b'], [1, 2]],
           labels=[[0, 0, 1, 1], [0, 1, 0, 1]])

In [30]:
pd.MultiIndex.from_product([['a', 'b'], [1, 2]])

MultiIndex(levels=[['a', 'b'], [1, 2]],
           labels=[[0, 0, 1, 1], [0, 1, 0, 1]])

In [31]:
pd.MultiIndex(levels=[['a', 'b'], [1, 2]],
labels=[[0, 0, 1, 1], [0, 1, 0, 1]])

MultiIndex(levels=[['a', 'b'], [1, 2]],
           labels=[[0, 0, 1, 1], [0, 1, 0, 1]])

In [10]:
'''MultiIndex level names'''
pop.index.names = ['state', 'year']
pop

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [15]:
'''MultiIndex for columns
In a DataFrame, the rows and columns are completely symmetric, and 
just as the rows can have multiple levels of indices, the columns 
can have multiple levels as well. Consider the following, which is a 
mock-up of some (somewhat realistic) medical data:'''
# hierarchical indices and columns
import numpy as np
index = pd.MultiIndex.from_product([[2013, 2014], [1, 2]],
names=['year', 'visit'])
columns = pd.MultiIndex.from_product([['Bob', 'Guido', 'Sue'], ['HR', 'Temp']],
names=['subject', 'type'])
# mock some data
data = np.round(np.random.randn(4, 6), 1)
data[:, ::2] *= 10
data += 37
# create the DataFrame
health_data = pd.DataFrame(data, index=index, columns=columns)
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      42.0  35.0  30.0  35.7  53.0  37.6
     2      48.0  37.8  38.0  37.4  30.0  36.7
2014 1      36.0  36.0  46.0  36.5  51.0  36.6
     2      22.0  39.2  40.0  38.0  59.0  36.1

In [34]:
'''Here we see where the multi-indexing for both rows and columns 
can come in very handy. This is fundamentally four-dimensional 
data, where the dimensions are the subject, the measurement type, 
the year, and the visit number. With this in place we can, for 
example, index the top-level column by the person’s name and get a 
full Data Frame containing just that person’s information:'''
health_data['Guido']

type          HR  Temp
year visit
2013 1      42.0  36.6
     2      37.0  37.1
2014 1      30.0  37.7
     2      55.0  35.5

In [35]:
'''Indexing and Slicing a MultiIndex'''
pop

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [36]:
pop['California', 2000]

33871648

In [37]:
pop['California']

year
2000    33871648
2010    37253956
dtype: int64

In [20]:
pop.loc['California':'New York',2000]

California  2000    33871648
New York    2000    18976457
dtype: int64

In [39]:
pop[:, 2000]

state
California    33871648
New York      18976457
Texas         20851820
dtype: int64

In [40]:
pop[pop > 22000000]

state       year
California  2000    33871648
            2010    37253956
Texas       2010    25145561
dtype: int64

In [41]:
pop[['California', 'Texas']]

state       year
California  2000    33871648
            2010    37253956
Texas       2000    20851820
            2010    25145561
dtype: int64

In [27]:
#Multiply indexed DataFrames
t=health_data['Guido']
type(t)
t

type          HR  Temp
year visit
2013 1      37.0  37.9
     2      63.0  36.2
2014 1      39.0  36.5
     2      29.0  37.2

In [25]:
t=health_data['Guido', 'HR']
print(type(t))
print(t)

<class 'pandas.core.series.Series'>
year  visit
2013  1        37.0
      2        63.0
2014  1        39.0
      2        29.0
Name: (Guido, HR), dtype: float64

In [44]:
health_data.iloc[:2, :2]

subject      Bob
type          HR  Temp
year visit
2013 1      42.0  37.3
     2      52.0  36.9

In [45]:
health_data.loc[:, ('Bob', 'HR')]

year  visit
2013  1        42.0
      2        52.0
2014  1        30.0
      2        48.0
Name: (Bob, HR), dtype: float64

In [28]:
health_data.loc[(:, 1), (:, 'HR')]

SyntaxError: invalid syntax (<ipython-input-28-fb34fa30ac09>, line 1)

In [47]:
idx = pd.IndexSlice
health_data.loc[idx[:, 1], idx[:, 'HR']]

subject      Bob Guido   Sue
type          HR    HR    HR
year visit
2013 1      42.0  42.0  24.0
2014 1      30.0  30.0  43.0

In [31]:
'''
Rearranging Multi-Indices
One of the keys to working with multiply indexed data is knowing how 
to effectively transform the data. There are a number of operations 
that will preserve all the information  in the dataset, but rearrange 
it for the purposes of various computations. We saw a brief example 
of this in the stack() and unstack() methods, but there are many more
ways to finely control the rearrangement of data between hierarchical
indices and columns, and we’ll explore them here.
Sorted and unsorted indices
'''
index = pd.MultiIndex.from_product([['a', 'c', 'b'], [1, 2]])
data = pd.Series(np.random.rand(6), index=index)
data.index.names = ['char', 'int']
data

char  int
a     1      0.349992
      2      0.236927
c     1      0.000212
      2      0.021022
b     1      0.773057
      2      0.982284
dtype: float64

In [32]:
try:
    data['a':'b']
except KeyError as e:
    print(type(e))
    print(e)

<class 'pandas.errors.UnsortedIndexError'>
'Key length (1) was greater than MultiIndex lexsort depth (0)'

In [50]:
data = data.sort_index()
data

char  int
a     1      0.260957
      2      0.996173
b     1      0.556226
      2      0.555236
c     1      0.980241
      2      0.613554
dtype: float64

In [51]:
data['a':'b']

char  int
a     1      0.260957
      2      0.996173
b     1      0.556226
      2      0.555236
dtype: float64

In [6]:
'''Stacking and unstacking indices'''
pop.unstack(level=0)

      California  New York     Texas
2000    33871648  18976457  20851820
2010    37253956  19378102  25145561

In [7]:
pop.unstack(level=1)

                2000      2010
California  33871648  37253956
New York    18976457  19378102
Texas       20851820  25145561

In [8]:
pop.unstack().stack()

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [11]:
'''Index setting and resetting'''
pop_flat = pop.reset_index(name='population')
pop_flat

        state  year  population
0  California  2000    33871648
1  California  2010    37253956
2    New York  2000    18976457
3    New York  2010    19378102
4       Texas  2000    20851820
5       Texas  2010    25145561

In [12]:
pop_flat.set_index(['state', 'year'])

                 population
state      year
California 2000    33871648
           2010    37253956
New York   2000    18976457
           2010    19378102
Texas      2000    20851820
           2010    25145561

In [17]:
'''Data Aggregations on Multi-Indices'''
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      42.0  35.0  30.0  35.7  53.0  37.6
     2      48.0  37.8  38.0  37.4  30.0  36.7
2014 1      36.0  36.0  46.0  36.5  51.0  36.6
     2      22.0  39.2  40.0  38.0  59.0  36.1

In [18]:
data_mean = health_data.mean(level='year')
data_mean

subject   Bob       Guido          Sue
type       HR  Temp    HR   Temp    HR   Temp
year
2013     45.0  36.4  34.0  36.55  41.5  37.15
2014     29.0  37.6  43.0  37.25  55.0  36.35

In [19]:
data_mean.mean(axis=1, level='type')

type         HR       Temp
year
2013  40.166667  36.700000
2014  42.333333  37.066667

In [21]:
'''Combining Datasets: Concat and Append'''
import pandas as pd
import numpy as np
def make_df(cols, ind):
    data = {c: [str(c) + str(i) for i in ind] for c in cols}
    return pd.DataFrame(data, ind)
# example DataFrame
make_df('ABC', range(3))

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2

In [2]:
x = [1, 2, 3]
y = [4, 5, 6]
z = [7, 8, 9]
np.concatenate([x, y, z])

array([1, 2, 3, 4, 5, 6, 7, 8, 9])

In [23]:
x = [[1, 2],
[3, 4]]
np.concatenate([x, x], axis=1)

array([[1, 2, 1, 2],
       [3, 4, 3, 4]])

In [26]:
'''Simple Concatenation with pd.concat
syntax:
pd.concat(objs, axis=0, join='outer', join_axes=None, ignore_index=False,
keys=None, levels=None, names=None, verify_integrity=False,
copy=True)'''
ser1 = pd.Series(['A', 'B', 'C'], index=[1, 2, 3])
ser2 = pd.Series(['D', 'E', 'F'], index=[4, 5, 6])
pd.concat([ser1, ser2])

1    A
2    B
3    C
4    D
5    E
6    F
dtype: object

In [6]:
df1 = make_df('AB', [1, 2])
df2 = make_df('AB', [3, 4])
print(df1); print(df2); print(pd.concat([df1, df2]))

    A   B
1  A1  B1
2  A2  B2
    A   B
3  A3  B3
4  A4  B4
    A   B
1  A1  B1
2  A2  B2
3  A3  B3
4  A4  B4

In [28]:
'''
By default, the concatenation takes place row-wise within the 
DataFrame (i.e.,axis=0). Like np.concatenate, pd.concat allows 
specification of an axis along which concatenation will take place. 
Consider the following example:
'''
df3 = make_df('AB', [0, 1])
df4 = make_df('CD', [0, 1])
print(df3)
print(df4)
print(pd.concat([df3, df4], axis=1))

    A   B
0  A0  B0
1  A1  B1
    A   B
0  A0  B0
1  A1  B1
    A   B   A   B
0  A0  B0  A0  B0
1  A1  B1  A1  B1

In [29]:
'''
Duplicate indices
One important difference between np.concatenate and pd.concat is that Pandas
concatenation preserves indices, even if the result will have duplicate indices! Consider
this simple example:
'''
x = make_df('AB', [0, 1])
y = make_df('AB', [2, 3])

In [30]:
y.index = x.index # make duplicate indices!
print(x); print(y); print(pd.concat([x, y]))

    A   B
0  A0  B0
1  A1  B1
    A   B
0  A2  B2
1  A3  B3
    A   B
0  A0  B0
1  A1  B1
0  A2  B2
1  A3  B3

In [9]:
'''
Catching the repeats as an error. If you’d like to simply verify 
that the indices in the result of pd.concat() do not overlap, 
you can specify the verify_integrity flag. With this set to True, 
the concatenation will raise an exception if there are duplicate
indices. Here is an example, where for clarity we’ll catch and print 
the error message:
'''
try:
    pd.concat([x, y], verify_integrity=True)
except ValueError as e:
    print("ValueError:", e)

ValueError: Indexes have overlapping values: Int64Index([0, 1], dtype='int64')

In [72]:
'''
Ignoring the index. Sometimes the index itself does not matter, and 
you would prefer it to simply be ignored. You can specify this option 
using the ignore_index flag. With this set to True, the concatenation 
will create a new integer index for the resulting Series:'''
print(x); print(y); print(pd.concat([x, y], ignore_index=True))

    A   B
0  A0  B0
1  A1  B1
    A   B
0  A2  B2
1  A3  B3
    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3

In [73]:
'''
Adding MultiIndex keys. Another alternative is to use the keys option to 
specify a label 
for the data sources; the result will be a hierarchically indexed series 
containing the data:'''
print(x); print(y); print(pd.concat([x, y], keys=['x', 'y']))

    A   B
0  A0  B0
1  A1  B1
    A   B
0  A2  B2
1  A3  B3
      A   B
x 0  A0  B0
  1  A1  B1
y 0  A2  B2
  1  A3  B3

In [10]:
'''Concatenation with joins'''
df5 = make_df('ABC', [1, 2])
df6 = make_df('BCD', [3, 4])
print(df5)
print(df6) 
print(pd.concat([df5, df6]))
'''
By default, the entries for which no data is available are filled with 
NA values. To change this, we can specify one of several options for 
the join and join_axes parameters of the concatenate function. By default, 
the join is a union of the input columns (join='outer'), but we can 
change this to an intersection of the columns using join='inner':
'''

    A   B   C
1  A1  B1  C1
2  A2  B2  C2
    B   C   D
3  B3  C3  D3
4  B4  C4  D4
     A   B   C    D
1   A1  B1  C1  NaN
2   A2  B2  C2  NaN
3  NaN  B3  C3   D3
4  NaN  B4  C4   D4

c:\users\lalit jangid\appdata\local\programs\python\python37\lib\site-packages\ipykernel_launcher.py:6: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

"\nBy default, the entries for which no data is available are filled with \nNA values. To change this, we can specify one of several options for \nthe join and join_axes parameters of the concatenate function. By default, \nthe join is a union of the input columns (join='outer'), but we can \nchange this to an intersection of the columns using join='inner':\n"

In [78]:
print(df5)
print(df6)
print(pd.concat([df5, df6], join='inner'))

    A   B   C
1  A1  B1  C1
2  A2  B2  C2
    B   C   D
3  B3  C3  D3
4  B4  C4  D4
    B   C
1  B1  C1
2  B2  C2
3  B3  C3
4  B4  C4

In [79]:
print(df5); print(df6);
print(pd.concat([df5, df6], join_axes=[df5.columns]))

    A   B   C
1  A1  B1  C1
2  A2  B2  C2
    B   C   D
3  B3  C3  D3
4  B4  C4  D4
     A   B   C
1   A1  B1  C1
2   A2  B2  C2
3  NaN  B3  C3
4  NaN  B4  C4

In [80]:
'''
The append() method
Because direct array concatenation is so common, Series and DataFrame 
objects have an append method that can accomplish the same thing in 
fewer keystrokes. For example, rather than calling pd.concat([df1, df2]), 
you can simply call df1.append(df2):
'''
print(df1); print(df2); print(df1.append(df2))

    A   B
1  A1  B1
2  A2  B2
    A   B
3  A3  B3
4  A4  B4
    A   B
1  A1  B1
2  A2  B2
3  A3  B3
4  A4  B4

In [31]:
'''
Combining Datasets: Merge and Join
One essential feature offered by Pandas is its high-performance, 
in-memory join and merge operations. If you have ever worked with
databases, you should be familiar with this type of data interaction. 
The main interface for this is the pd.merge function, and we’ll see a 
few examples of how this can work in practice.
Relational Algebra
The behavior implemented in pd.merge() is a subset of what is known 
as relational algebra, which is a formal set of rules for manipulating 
relational data, and forms the conceptual foundation of operations 
available in most databases. The strength of the
'''
#One-to-one joins
df1 = pd.DataFrame({'employee': ['Bob', 'Jake', 'Lisa', 'Sue'],
'group': ['Accounting', 'Engineering', 'Engineering', 'HR']})
df2 = pd.DataFrame({'employee': ['Lisa', 'Bob', 'Jake', 'Sue'],
'hire_date': [2004, 2008, 2012, 2014]})
print(df1); print(df2)

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR
  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2014

In [82]:
df3 = pd.merge(df1, df2)
df3

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

In [83]:
'''Many-to-one joins'''
df4 = pd.DataFrame({'group': ['Accounting', 'Engineering', 'HR'],
'supervisor': ['Carly', 'Guido', 'Steve']})
print(df3); print(df4); print(pd.merge(df3, df4))

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014
         group supervisor
0   Accounting      Carly
1  Engineering      Guido
2           HR      Steve
  employee        group  hire_date supervisor
0      Bob   Accounting       2008      Carly
1     Jake  Engineering       2012      Guido
2     Lisa  Engineering       2004      Guido
3      Sue           HR       2014      Steve

In [84]:
'''Many-to-many joins'''
df5 = pd.DataFrame({'group': ['Accounting', 'Accounting',
'Engineering', 'Engineering', 'HR', 'HR'],'skills': ['math', 'spreadsheets', 
                                                     'coding', 'linux',
                                                     'spreadsheets', 
                                                     'organization']})
print(df1); print(df5); print(pd.merge(df1, df5))

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR
         group        skills
0   Accounting          math
1   Accounting  spreadsheets
2  Engineering        coding
3  Engineering         linux
4           HR  spreadsheets
5           HR  organization
  employee        group        skills
0      Bob   Accounting          math
1      Bob   Accounting  spreadsheets
2     Jake  Engineering        coding
3     Jake  Engineering         linux
4     Lisa  Engineering        coding
5     Lisa  Engineering         linux
6      Sue           HR  spreadsheets
7      Sue           HR  organization

In [85]:
'''
The on keyword
Most simply, you can explicitly specify the name of the key column 
using the on keyword, which takes a column name or a list of column names:
'''
print(df1); print(df2); print(pd.merge(df1, df2, on='employee'))

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR
  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2014
  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

In [86]:
'''
The left_on and right_on keywords
At times you may wish to merge two datasets with different column names; 
for example,we may have a dataset in which the employee name is labeled 
as “name” rather than “employee”. In this case, we can use the left_on 
and right_on keywords to specify the two column names:
'''
df3 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],
'salary': [70000, 80000, 120000, 90000]})
print(df1); print(df3);
print(pd.merge(df1, df3, left_on="employee", right_on="name"))

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR
   name  salary
0   Bob   70000
1  Jake   80000
2  Lisa  120000
3   Sue   90000
  employee        group  name  salary
0      Bob   Accounting   Bob   70000
1     Jake  Engineering  Jake   80000
2     Lisa  Engineering  Lisa  120000
3      Sue           HR   Sue   90000

In [87]:
pd.merge(df1, df3, left_on="employee", right_on="name").drop('name', axis=1)

  employee        group  salary
0      Bob   Accounting   70000
1     Jake  Engineering   80000
2     Lisa  Engineering  120000
3      Sue           HR   90000

In [88]:
df1a = df1.set_index('employee')
df2a = df2.set_index('employee')
print(df1a); print(df2a)

                group
employee
Bob        Accounting
Jake      Engineering
Lisa      Engineering
Sue                HR
          hire_date
employee
Lisa           2004
Bob            2008
Jake           2012
Sue            2014

In [89]:
print(df1a); print(df2a);
print(pd.merge(df1a, df2a, left_index=True, right_index=True))

                group
employee
Bob        Accounting
Jake      Engineering
Lisa      Engineering
Sue                HR
          hire_date
employee
Lisa           2004
Bob            2008
Jake           2012
Sue            2014
                group  hire_date
employee
Bob        Accounting       2008
Jake      Engineering       2012
Lisa      Engineering       2004
Sue                HR       2014

In [90]:
print(df1a); print(df2a); print(df1a.join(df2a))

                group
employee
Bob        Accounting
Jake      Engineering
Lisa      Engineering
Sue                HR
          hire_date
employee
Lisa           2004
Bob            2008
Jake           2012
Sue            2014
                group  hire_date
employee
Bob        Accounting       2008
Jake      Engineering       2012
Lisa      Engineering       2004
Sue                HR       2014

In [91]:
print(df1a); print(df3);
print(pd.merge(df1a, df3, left_index=True, right_on='name'))

                group
employee
Bob        Accounting
Jake      Engineering
Lisa      Engineering
Sue                HR
   name  salary
0   Bob   70000
1  Jake   80000
2  Lisa  120000
3   Sue   90000
         group  name  salary
0   Accounting   Bob   70000
1  Engineering  Jake   80000
2  Engineering  Lisa  120000
3           HR   Sue   90000

In [93]:
df6 = pd.DataFrame({'name': ['Peter', 'Paul', 'Mary'],
'food': ['fish', 'beans', 'bread']},
columns=['name', 'food'])
df7 = pd.DataFrame({'name': ['Mary', 'Joseph'],
'drink': ['wine', 'beer']},
columns=['name', 'drink'])
print(df6); print(df7); print(pd.merge(df6, df7))

    name   food
0  Peter   fish
1   Paul  beans
2   Mary  bread
     name drink
0    Mary  wine
1  Joseph  beer
   name   food drink
0  Mary  bread  wine

In [94]:
pd.merge(df6, df7, how='inner')

   name   food drink
0  Mary  bread  wine

In [95]:
print(df6); print(df7); print(pd.merge(df6, df7, how='outer'))

    name   food
0  Peter   fish
1   Paul  beans
2   Mary  bread
     name drink
0    Mary  wine
1  Joseph  beer
     name   food drink
0   Peter   fish   NaN
1    Paul  beans   NaN
2    Mary  bread  wine
3  Joseph    NaN  beer

In [96]:
print(df6); print(df7); print(pd.merge(df6, df7, how='left'))

    name   food
0  Peter   fish
1   Paul  beans
2   Mary  bread
     name drink
0    Mary  wine
1  Joseph  beer
    name   food drink
0  Peter   fish   NaN
1   Paul  beans   NaN
2   Mary  bread  wine

In [97]:
'''Overlapping Column Names: The suffixes Keyword'''
df8 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],
'rank': [1, 2, 3, 4]})

In [98]:
df9 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],
'rank': [3, 1, 4, 2]})
print(df8); print(df9); print(pd.merge(df8, df9, on="name"))

   name  rank
0   Bob     1
1  Jake     2
2  Lisa     3
3   Sue     4
   name  rank
0   Bob     3
1  Jake     1
2  Lisa     4
3   Sue     2
   name  rank_x  rank_y
0   Bob       1       3
1  Jake       2       1
2  Lisa       3       4
3   Sue       4       2

In [99]:
print(df8); print(df9);
print(pd.merge(df8, df9, on="name", suffixes=["_L", "_R"]))

   name  rank
0   Bob     1
1  Jake     2
2  Lisa     3
3   Sue     4
   name  rank
0   Bob     3
1  Jake     1
2  Lisa     4
3   Sue     2
   name  rank_L  rank_R
0   Bob       1       3
1  Jake       2       1
2  Lisa       3       4
3   Sue       4       2

In [13]:
'''GroupBy: Split, Apply, Combine'''
df = pd.DataFrame({'key': ['A', 'B', 'C', 'A', 'B', 'C'],
'data': range(6)}, columns=['key', 'data'])
df

  key  data
0   A     0
1   B     1
2   C     2
3   A     3
4   B     4
5   C     5

In [101]:
df.groupby('key')

In [102]:
df.groupby('key').sum()

     data
key
A       3
B       5
C       7